[Survived] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:40:28
     turnEnd?: TurnEndHandler;
     input?: InputHandler;
   } = {};
-  protected _initialized = false;
+  protected _initialized = true;
   protected _statusLine?: string;
   

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:43:26
   protected _initialized = false;
   protected _statusLine?: string;
   
-  constructor(cli?: CLI) {
-    this._capabilities = getCLICapabilites(cli);
-  }
+  constructor(cli?: CLI) {}
   
   get capabilities(): CLICapabilities {
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: Cannot read properties of undefined (reading 'hasToolCall')

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:47:39
     this._capabilities = getCLICapabilites(cli);
   }
   
-  get capabilities(): CLICapabilities {
-    return this._capabilities;
-  }
+  get capabilities(): CLICapabilities {}
   
   // ── Lifecycle ──────────────────────────────────────────────────────

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:53:22
   
   // ── Lifecycle ──────────────────────────────────────────────────────
   
-  initialize(): void {
-    this._initialized = true;
-  }
+  initialize(): void {}
   
   dispose(): void {

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:54:25
   // ── Lifecycle ──────────────────────────────────────────────────────
   
   initialize(): void {
-    this._initialized = true;
+    this._initialized = false;
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:57:19
     this._initialized = true;
   }
   
-  dispose(): void {
-    this._initialized = false;
-    this._handlers = {};
-    this.clearStatusLine();
-  }
+  dispose(): void {}
   
   // ── Commands ───────────────────────────────────────────────────────

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:58:25
   }
   
   dispose(): void {
-    this._initialized = false;
+    this._initialized = true;
     this._handlers = {};
     this.clearStatusLine();

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:65:45
   
   // ── Commands ───────────────────────────────────────────────────────
   
-  registerCommands(): CommandRegistration[] {
-    // Default: no commands registered
-    return [];
-  }
+  registerCommands(): CommandRegistration[] {}
   
   getCommandPrefix(): string {

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:70:30
     return [];
   }
   
-  getCommandPrefix(): string {
-    return this._capabilities.commandPrefix || "/";
-  }
+  getCommandPrefix(): string {}
   
   // ── Events ─────────────────────────────────────────────────────────

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/base.ts:71:12
   }
   
   getCommandPrefix(): string {
-    return this._capabilities.commandPrefix || "/";
+    return this._capabilities.commandPrefix && "/";
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:71:12
   }
   
   getCommandPrefix(): string {
-    return this._capabilities.commandPrefix || "/";
+    return true;
   }
   

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:76:46
   
   // ── Events ─────────────────────────────────────────────────────────
   
-  onToolCall(handler: ToolCallHandler): void {
-    if (!this._capabilities.hasToolCall) {
-      console.warn(`[${this.name}] Tool call events not supported`);
-      return;
-    }
-    this._handlers.toolCall = handler;
-  }
+  onToolCall(handler: ToolCallHandler): void {}
   
   onSessionStart(handler: SessionStartHandler): void {

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:77:42
   // ── Events ─────────────────────────────────────────────────────────
   
   onToolCall(handler: ToolCallHandler): void {
-    if (!this._capabilities.hasToolCall) {
-      console.warn(`[${this.name}] Tool call events not supported`);
-      return;
-    }
+    if (!this._capabilities.hasToolCall) {}
     this._handlers.toolCall = handler;
   }

[Survived] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:77:9
   // ── Events ─────────────────────────────────────────────────────────
   
   onToolCall(handler: ToolCallHandler): void {
-    if (!this._capabilities.hasToolCall) {
+    if (this._capabilities.hasToolCall) {
       console.warn(`[${this.name}] Tool call events not supported`);
       return;

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:84:54
     this._handlers.toolCall = handler;
   }
   
-  onSessionStart(handler: SessionStartHandler): void {
-    if (!this._capabilities.hasSessionStart) {
-      console.warn(`[${this.name}] Session start events not supported`);
-      return;
-    }
-    this._handlers.sessionStart = handler;
-  }
+  onSessionStart(handler: SessionStartHandler): void {}
   
   onTurnEnd(handler: TurnEndHandler): void {

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:85:46
   }
   
   onSessionStart(handler: SessionStartHandler): void {
-    if (!this._capabilities.hasSessionStart) {
-      console.warn(`[${this.name}] Session start events not supported`);
-      return;
-    }
+    if (!this._capabilities.hasSessionStart) {}
     this._handlers.sessionStart = handler;
   }

[Survived] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:85:9
   }
   
   onSessionStart(handler: SessionStartHandler): void {
-    if (!this._capabilities.hasSessionStart) {
+    if (this._capabilities.hasSessionStart) {
       console.warn(`[${this.name}] Session start events not supported`);
       return;

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:92:44
     this._handlers.sessionStart = handler;
   }
   
-  onTurnEnd(handler: TurnEndHandler): void {
-    if (!this._capabilities.hasTurnEnd) {
-      console.warn(`[${this.name}] Turn end events not supported`);
-      return;
-    }
-    this._handlers.turnEnd = handler;
-  }
+  onTurnEnd(handler: TurnEndHandler): void {}
   
   onInput(handler: InputHandler): void {

[Survived] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:93:9
   }
   
   onTurnEnd(handler: TurnEndHandler): void {
-    if (!this._capabilities.hasTurnEnd) {
+    if (true) {
       console.warn(`[${this.name}] Turn end events not supported`);
       return;

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:93:41
   }
   
   onTurnEnd(handler: TurnEndHandler): void {
-    if (!this._capabilities.hasTurnEnd) {
-      console.warn(`[${this.name}] Turn end events not supported`);
-      return;
-    }
+    if (!this._capabilities.hasTurnEnd) {}
     this._handlers.turnEnd = handler;
   }

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:100:40
     this._handlers.turnEnd = handler;
   }
   
-  onInput(handler: InputHandler): void {
-    // Input handling is always supported (via parsing)
-    this._handlers.input = handler;
-  }
+  onInput(handler: InputHandler): void {}
   
   // ── Event Invokers ─────────────────────────────────────────────────

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:111:81
    * Invoke tool call handler.
    * Called by the integration code when a tool is invoked.
    */
-  protected _invokeToolCall(tool: string, input: unknown): void | Promise<void> {
-    if (this._handlers.toolCall) {
-      return this._handlers.toolCall(tool, input);
-    }
-  }
+  protected _invokeToolCall(tool: string, input: unknown): void | Promise<void> {}
   
   /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:112:34
    * Called by the integration code when a tool is invoked.
    */
   protected _invokeToolCall(tool: string, input: unknown): void | Promise<void> {
-    if (this._handlers.toolCall) {
-      return this._handlers.toolCall(tool, input);
-    }
+    if (this._handlers.toolCall) {}
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:112:9
    * Called by the integration code when a tool is invoked.
    */
   protected _invokeToolCall(tool: string, input: unknown): void | Promise<void> {
-    if (this._handlers.toolCall) {
+    if (true) {
       return this._handlers.toolCall(tool, input);
     }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:121:68
    * Invoke session start handler.
    * Called by the integration code when a session starts.
    */
-  protected _invokeSessionStart(cwd: string): void | Promise<void> {
-    if (this._handlers.sessionStart) {
-      return this._handlers.sessionStart(cwd);
-    }
-  }
+  protected _invokeSessionStart(cwd: string): void | Promise<void> {}
   
   /**

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:122:9
    * Called by the integration code when a session starts.
    */
   protected _invokeSessionStart(cwd: string): void | Promise<void> {
-    if (this._handlers.sessionStart) {
+    if (true) {
       return this._handlers.sessionStart(cwd);
     }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:122:9
    * Called by the integration code when a session starts.
    */
   protected _invokeSessionStart(cwd: string): void | Promise<void> {
-    if (this._handlers.sessionStart) {
+    if (false) {
       return this._handlers.sessionStart(cwd);
     }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:131:92
    * Invoke turn end handler.
    * Called by the integration code when a turn ends.
    */
-  protected _invokeTurnEnd(ctx: { cwd: string; sessionId?: string }): void | Promise<void> {
-    if (this._handlers.turnEnd) {
-      return this._handlers.turnEnd(ctx);
-    }
-  }
+  protected _invokeTurnEnd(ctx: { cwd: string; sessionId?: string }): void | Promise<void> {}
   
   /**

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:132:9
    * Called by the integration code when a turn ends.
    */
   protected _invokeTurnEnd(ctx: { cwd: string; sessionId?: string }): void | Promise<void> {
-    if (this._handlers.turnEnd) {
+    if (true) {
       return this._handlers.turnEnd(ctx);
     }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:132:9
    * Called by the integration code when a turn ends.
    */
   protected _invokeTurnEnd(ctx: { cwd: string; sessionId?: string }): void | Promise<void> {
-    if (this._handlers.turnEnd) {
+    if (false) {
       return this._handlers.turnEnd(ctx);
     }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:141:104
    * Invoke input handler.
    * Called by the integration code when input is received.
    */
-  protected _invokeInput(text: string, ctx: { cwd: string; sessionId?: string }): void | Promise<void> {
-    if (this._handlers.input) {
-      return this._handlers.input(text, ctx);
-    }
-  }
+  protected _invokeInput(text: string, ctx: { cwd: string; sessionId?: string }): void | Promise<void> {}
   
   // ── Tools ──────────────────────────────────────────────────────────

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:142:9
    * Called by the integration code when input is received.
    */
   protected _invokeInput(text: string, ctx: { cwd: string; sessionId?: string }): void | Promise<void> {
-    if (this._handlers.input) {
+    if (true) {
       return this._handlers.input(text, ctx);
     }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:142:9
    * Called by the integration code when input is received.
    */
   protected _invokeInput(text: string, ctx: { cwd: string; sessionId?: string }): void | Promise<void> {
-    if (this._handlers.input) {
+    if (false) {
       return this._handlers.input(text, ctx);
     }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:149:41
   
   // ── Tools ──────────────────────────────────────────────────────────
   
-  getAvailableTools(): ToolDefinition[] {
-    // Default: return standard tools available in all CLIs
-    return [
-      { name: "read", description: "Read file contents" },
-      { name: "write", description: "Write content to file" },
-      { name: "bash", description: "Execute shell commands" },
-      { name: "edit", description: "Edit existing files" },
-    ];
-  }
+  getAvailableTools(): ToolDefinition[] {}
   
   hasCapability(capability: keyof CLICapabilities): boolean {

[NoCoverage] ObjectLiteral
extensions/cali-product-workflow/adapters/base.ts:153:7
     // Default: return standard tools available in all CLIs
     return [
       { name: "read", description: "Read file contents" },
-      { name: "write", description: "Write content to file" },
+      {},
       { name: "bash", description: "Execute shell commands" },
       { name: "edit", description: "Edit existing files" },

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/base.ts:153:37
     // Default: return standard tools available in all CLIs
     return [
       { name: "read", description: "Read file contents" },
-      { name: "write", description: "Write content to file" },
+      { name: "write", description: "" },
       { name: "bash", description: "Execute shell commands" },
       { name: "edit", description: "Edit existing files" },

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/base.ts:154:15
     return [
       { name: "read", description: "Read file contents" },
       { name: "write", description: "Write content to file" },
-      { name: "bash", description: "Execute shell commands" },
+      { name: "", description: "Execute shell commands" },
       { name: "edit", description: "Edit existing files" },
     ];

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/base.ts:155:36
       { name: "read", description: "Read file contents" },
       { name: "write", description: "Write content to file" },
       { name: "bash", description: "Execute shell commands" },
-      { name: "edit", description: "Edit existing files" },
+      { name: "edit", description: "" },
     ];
   }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:159:61
     ];
   }
   
-  hasCapability(capability: keyof CLICapabilities): boolean {
-    const value = this._capabilities[capability];
-    // Handle boolean and non-null values
-    if (typeof value === "boolean") return value;
-    return value !== null && value !== undefined;
-  }
+  hasCapability(capability: keyof CLICapabilities): boolean {}
   
   // ── UI ──────────────────────────────────────────────────────────────

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/base.ts:162:9
   hasCapability(capability: keyof CLICapabilities): boolean {
     const value = this._capabilities[capability];
     // Handle boolean and non-null values
-    if (typeof value === "boolean") return value;
+    if (typeof value !== "boolean") return value;
     return value !== null && value !== undefined;
   }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:162:9
   hasCapability(capability: keyof CLICapabilities): boolean {
     const value = this._capabilities[capability];
     // Handle boolean and non-null values
-    if (typeof value === "boolean") return value;
+    if (false) return value;
     return value !== null && value !== undefined;
   }

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/base.ts:163:12
     const value = this._capabilities[capability];
     // Handle boolean and non-null values
     if (typeof value === "boolean") return value;
-    return value !== null && value !== undefined;
+    return value === null && value !== undefined;
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:163:12
     const value = this._capabilities[capability];
     // Handle boolean and non-null values
     if (typeof value === "boolean") return value;
-    return value !== null && value !== undefined;
+    return true;
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:168:76
   
   // ── UI ──────────────────────────────────────────────────────────────
   
-  showNotification(message: string, type: NotificationType = "info"): void {
-    if (!this._capabilities.hasNotifications) {
-      console.log(`[${type.toUpperCase()}] ${message}`);
-      return;
-    }
-    // Override in subclass for CLI-specific implementation
-    this._showNotificationImpl(message, type);
-  }
+  showNotification(message: string, type: NotificationType = "info"): void {}
   
   protected _showNotificationImpl(message: string, type: NotificationType): void {

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:169:47
   // ── UI ──────────────────────────────────────────────────────────────
   
   showNotification(message: string, type: NotificationType = "info"): void {
-    if (!this._capabilities.hasNotifications) {
-      console.log(`[${type.toUpperCase()}] ${message}`);
-      return;
-    }
+    if (!this._capabilities.hasNotifications) {}
     // Override in subclass for CLI-specific implementation
     this._showNotificationImpl(message, type);

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:169:9
   // ── UI ──────────────────────────────────────────────────────────────
   
   showNotification(message: string, type: NotificationType = "info"): void {
-    if (!this._capabilities.hasNotifications) {
+    if (false) {
       console.log(`[${type.toUpperCase()}] ${message}`);
       return;

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/base.ts:170:23
   
   showNotification(message: string, type: NotificationType = "info"): void {
     if (!this._capabilities.hasNotifications) {
-      console.log(`[${type.toUpperCase()}] ${message}`);
+      console.log(`[${type.toLowerCase()}] ${message}`);
       return;
     }

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/base.ts:170:19
   
   showNotification(message: string, type: NotificationType = "info"): void {
     if (!this._capabilities.hasNotifications) {
-      console.log(`[${type.toUpperCase()}] ${message}`);
+      console.log(``);
       return;
     }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:177:82
     this._showNotificationImpl(message, type);
   }
   
-  protected _showNotificationImpl(message: string, type: NotificationType): void {
-    // Default: log to console
-    console.log(`[${type.toUpperCase()}] ${message}`);
-  }
+  protected _showNotificationImpl(message: string, type: NotificationType): void {}
   
   async showSelectList(options: SelectOption[]): Promise<string | null> {

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/base.ts:179:21
   
   protected _showNotificationImpl(message: string, type: NotificationType): void {
     // Default: log to console
-    console.log(`[${type.toUpperCase()}] ${message}`);
+    console.log(`[${type.toLowerCase()}] ${message}`);
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:182:73
     console.log(`[${type.toUpperCase()}] ${message}`);
   }
   
-  async showSelectList(options: SelectOption[]): Promise<string | null> {
-    if (!this._capabilities.hasSelectList) {
-      // Fallback: return first option or null
-      console.warn(`[${this.name}] Select list not supported, returning first option`);
-      return options[0]?.value || null;
-    }
-    return this._showSelectListImpl(options);
-  }
+  async showSelectList(options: SelectOption[]): Promise<string | null> {}
   
   protected _showSelectListImpl(options: SelectOption[]): Promise<string | null> {

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:183:9
   }
   
   async showSelectList(options: SelectOption[]): Promise<string | null> {
-    if (!this._capabilities.hasSelectList) {
+    if (this._capabilities.hasSelectList) {
       // Fallback: return first option or null
       console.warn(`[${this.name}] Select list not supported, returning first option`);

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:183:9
   }
   
   async showSelectList(options: SelectOption[]): Promise<string | null> {
-    if (!this._capabilities.hasSelectList) {
+    if (true) {
       // Fallback: return first option or null
       console.warn(`[${this.name}] Select list not supported, returning first option`);

[NoCoverage] OptionalChaining
extensions/cali-product-workflow/adapters/base.ts:186:14
     if (!this._capabilities.hasSelectList) {
       // Fallback: return first option or null
       console.warn(`[${this.name}] Select list not supported, returning first option`);
-      return options[0]?.value || null;
+      return options[0].value || null;
     }
     return this._showSelectListImpl(options);

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/base.ts:186:14
     if (!this._capabilities.hasSelectList) {
       // Fallback: return first option or null
       console.warn(`[${this.name}] Select list not supported, returning first option`);
-      return options[0]?.value || null;
+      return options[0]?.value && null;
     }
     return this._showSelectListImpl(options);

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:191:82
     return this._showSelectListImpl(options);
   }
   
-  protected _showSelectListImpl(options: SelectOption[]): Promise<string | null> {
-    // Default: return first option
-    return Promise.resolve(options[0]?.value || null);
-  }
+  protected _showSelectListImpl(options: SelectOption[]): Promise<string | null> {}
   
   showStatusLine(info: StatusInfo): void {

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/base.ts:193:28
   
   protected _showSelectListImpl(options: SelectOption[]): Promise<string | null> {
     // Default: return first option
-    return Promise.resolve(options[0]?.value || null);
+    return Promise.resolve(options[0]?.value && null);
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:193:28
   
   protected _showSelectListImpl(options: SelectOption[]): Promise<string | null> {
     // Default: return first option
-    return Promise.resolve(options[0]?.value || null);
+    return Promise.resolve(false);
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:196:42
     return Promise.resolve(options[0]?.value || null);
   }
   
-  showStatusLine(info: StatusInfo): void {
-    if (!this._capabilities.hasStatusLine) {
-      return;
-    }
-    this._statusLine = info.text;
-    this._showStatusLineImpl(info);
-  }
+  showStatusLine(info: StatusInfo): void {}
   
   protected _showStatusLineImpl(info: StatusInfo): void {

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:197:9
   }
   
   showStatusLine(info: StatusInfo): void {
-    if (!this._capabilities.hasStatusLine) {
+    if (false) {
       return;
     }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:197:44
   }
   
   showStatusLine(info: StatusInfo): void {
-    if (!this._capabilities.hasStatusLine) {
-      return;
-    }
+    if (!this._capabilities.hasStatusLine) {}
     this._statusLine = info.text;
     this._showStatusLineImpl(info);

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:208:27
     // Default: no-op
   }
   
-  clearStatusLine(): void {
-    this._statusLine = undefined;
-    this._clearStatusLineImpl();
-  }
+  clearStatusLine(): void {}
   
   protected _clearStatusLineImpl(): void {

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:227:17
 export function parseCommandArgs(args: string): string[] {
   const result: string[] = [];
   let current = "";
-  let inQuote = false;
+  let inQuote = true;
   let quoteChar = "";
   

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/base.ts:228:19
   const result: string[] = [];
   let current = "";
   let inQuote = false;
-  let quoteChar = "";
+  let quoteChar = "Stryker was here!";
   
   for (let i = 0; i < args.length; i++) {

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/base.ts:230:19
   let inQuote = false;
   let quoteChar = "";
   
-  for (let i = 0; i < args.length; i++) {
+  for (let i = 0; i <= args.length; i++) {
     const char = args[i];
     

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:230:19
   let inQuote = false;
   let quoteChar = "";
   
-  for (let i = 0; i < args.length; i++) {
+  for (let i = 0; false; i++) {
     const char = args[i];
     

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/base.ts:233:10
   for (let i = 0; i < args.length; i++) {
     const char = args[i];
     
-    if ((char === '"' || char === "'") && !inQuote) {
+    if ((char !== '"' || char === "'") && !inQuote) {
       inQuote = true;
       quoteChar = char;

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:233:43
   for (let i = 0; i < args.length; i++) {
     const char = args[i];
     
-    if ((char === '"' || char === "'") && !inQuote) {
+    if ((char === '"' || char === "'") && inQuote) {
       inQuote = true;
       quoteChar = char;

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:234:17
     const char = args[i];
     
     if ((char === '"' || char === "'") && !inQuote) {
-      inQuote = true;
+      inQuote = false;
       quoteChar = char;
     } else if (char === quoteChar && inQuote) {

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/base.ts:236:16
     if ((char === '"' || char === "'") && !inQuote) {
       inQuote = true;
       quoteChar = char;
-    } else if (char === quoteChar && inQuote) {
+    } else if (char === quoteChar || inQuote) {
       inQuote = false;
       quoteChar = "";

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/base.ts:236:16
     if ((char === '"' || char === "'") && !inQuote) {
       inQuote = true;
       quoteChar = char;
-    } else if (char === quoteChar && inQuote) {
+    } else if (char !== quoteChar && inQuote) {
       inQuote = false;
       quoteChar = "";

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/base.ts:237:17
       inQuote = true;
       quoteChar = char;
     } else if (char === quoteChar && inQuote) {
-      inQuote = false;
+      inQuote = true;
       quoteChar = "";
     } else if (char === "\\" && i + 1 < args.length) {

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/base.ts:238:19
       quoteChar = char;
     } else if (char === quoteChar && inQuote) {
       inQuote = false;
-      quoteChar = "";
+      quoteChar = "Stryker was here!";
     } else if (char === "\\" && i + 1 < args.length) {
       current += args[++i];

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:239:16
     } else if (char === quoteChar && inQuote) {
       inQuote = false;
       quoteChar = "";
-    } else if (char === "\\" && i + 1 < args.length) {
+    } else if (true) {
       current += args[++i];
     } else if (char === " " && !inQuote) {

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:239:16
     } else if (char === quoteChar && inQuote) {
       inQuote = false;
       quoteChar = "";
-    } else if (char === "\\" && i + 1 < args.length) {
+    } else if (true && i + 1 < args.length) {
       current += args[++i];
     } else if (char === " " && !inQuote) {

[NoCoverage] UpdateOperator
extensions/cali-product-workflow/adapters/base.ts:240:23
       inQuote = false;
       quoteChar = "";
     } else if (char === "\\" && i + 1 < args.length) {
-      current += args[++i];
+      current += args[--i];
     } else if (char === " " && !inQuote) {
       if (current) {

[NoCoverage] AssignmentOperator
extensions/cali-product-workflow/adapters/base.ts:240:7
       inQuote = false;
       quoteChar = "";
     } else if (char === "\\" && i + 1 < args.length) {
-      current += args[++i];
+      current -= args[++i];
     } else if (char === " " && !inQuote) {
       if (current) {

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:241:16
       quoteChar = "";
     } else if (char === "\\" && i + 1 < args.length) {
       current += args[++i];
-    } else if (char === " " && !inQuote) {
+    } else if (true) {
       if (current) {
         result.push(current);

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:241:16
       quoteChar = "";
     } else if (char === "\\" && i + 1 < args.length) {
       current += args[++i];
-    } else if (char === " " && !inQuote) {
+    } else if (true && !inQuote) {
       if (current) {
         result.push(current);

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:242:11
     } else if (char === "\\" && i + 1 < args.length) {
       current += args[++i];
     } else if (char === " " && !inQuote) {
-      if (current) {
+      if (false) {
         result.push(current);
         current = "";
