[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:242:20
     } else if (char === "\\" && i + 1 < args.length) {
       current += args[++i];
     } else if (char === " " && !inQuote) {
-      if (current) {
-        result.push(current);
-        current = "";
-      }
+      if (current) {}
     } else {
       current += char;

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:246:12
         result.push(current);
         current = "";
       }
-    } else {
-      current += char;
-    }
+    } else {}
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:251:7
     }
   }
   
-  if (current) {
+  if (true) {
     result.push(current);
   }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:264:11
 export function formatNotification(
   message: string,
   type: NotificationType
-): string {
-  const colors: Record<NotificationType, string> = {
-    info: "\x1b[36m",      // cyan
-    warning: "\x1b[33m",   // yellow
-    error: "\x1b[31m",    // red
-    success: "\x1b[32m",  // green
-  };
-  const reset = "\x1b[0m";
-  return `${colors[type]}[${type.toUpperCase()}]${reset} ${message}`;
-}
+): string {}
 
 /**

[NoCoverage] ObjectLiteral
extensions/cali-product-workflow/adapters/base.ts:265:52
   message: string,
   type: NotificationType
 ): string {
-  const colors: Record<NotificationType, string> = {
-    info: "\x1b[36m",      // cyan
-    warning: "\x1b[33m",   // yellow
-    error: "\x1b[31m",    // red
-    success: "\x1b[32m",  // green
-  };
+  const colors: Record<NotificationType, string> = {};
   const reset = "\x1b[0m";
   return `${colors[type]}[${type.toUpperCase()}]${reset} ${message}`;

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/base.ts:271:17
     error: "\x1b[31m",    // red
     success: "\x1b[32m",  // green
   };
-  const reset = "\x1b[0m";
+  const reset = "";
   return `${colors[type]}[${type.toUpperCase()}]${reset} ${message}`;
 }

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/base.ts:272:29
     success: "\x1b[32m",  // green
   };
   const reset = "\x1b[0m";
-  return `${colors[type]}[${type.toUpperCase()}]${reset} ${message}`;
+  return `${colors[type]}[${type.toLowerCase()}]${reset} ${message}`;
 }
 

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:278:73
 /**
  * Truncate text to fit in status line.
  */
-export function truncateStatusLine(text: string, maxWidth = 80): string {
-  if (text.length <= maxWidth) return text;
-  return text.slice(0, maxWidth - 3) + "...";
-}
+export function truncateStatusLine(text: string, maxWidth = 80): string {}
 
 /**

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:279:7
  * Truncate text to fit in status line.
  */
 export function truncateStatusLine(text: string, maxWidth = 80): string {
-  if (text.length <= maxWidth) return text;
+  if (false) return text;
   return text.slice(0, maxWidth - 3) + "...";
 }

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/base.ts:279:7
  * Truncate text to fit in status line.
  */
 export function truncateStatusLine(text: string, maxWidth = 80): string {
-  if (text.length <= maxWidth) return text;
+  if (text.length < maxWidth) return text;
   return text.slice(0, maxWidth - 3) + "...";
 }

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/base.ts:280:10
  */
 export function truncateStatusLine(text: string, maxWidth = 80): string {
   if (text.length <= maxWidth) return text;
-  return text.slice(0, maxWidth - 3) + "...";
+  return text + "...";
 }
 

[NoCoverage] ArithmeticOperator
extensions/cali-product-workflow/adapters/base.ts:280:24
  */
 export function truncateStatusLine(text: string, maxWidth = 80): string {
   if (text.length <= maxWidth) return text;
-  return text.slice(0, maxWidth - 3) + "...";
+  return text.slice(0, maxWidth + 3) + "...";
 }
 

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:289:37
 export function debounce<T extends (...args: unknown[]) => unknown>(
   fn: T,
   delay: number
-): (...args: Parameters<T>) => void {
-  let timeout: NodeJS.Timeout | null = null;
-  return (...args: Parameters<T>) => {
-    if (timeout) clearTimeout(timeout);
-    timeout = setTimeout(() => fn(...args), delay);
-  };
-}
+): (...args: Parameters<T>) => void {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:291:38
   delay: number
 ): (...args: Parameters<T>) => void {
   let timeout: NodeJS.Timeout | null = null;
-  return (...args: Parameters<T>) => {
-    if (timeout) clearTimeout(timeout);
-    timeout = setTimeout(() => fn(...args), delay);
-  };
+  return (...args: Parameters<T>) => {};
 }
 

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:292:9
 ): (...args: Parameters<T>) => void {
   let timeout: NodeJS.Timeout | null = null;
   return (...args: Parameters<T>) => {
-    if (timeout) clearTimeout(timeout);
+    if (true) clearTimeout(timeout);
     timeout = setTimeout(() => fn(...args), delay);
   };

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:292:9
 ): (...args: Parameters<T>) => void {
   let timeout: NodeJS.Timeout | null = null;
   return (...args: Parameters<T>) => {
-    if (timeout) clearTimeout(timeout);
+    if (false) clearTimeout(timeout);
     timeout = setTimeout(() => fn(...args), delay);
   };

[NoCoverage] ArrowFunction
extensions/cali-product-workflow/adapters/base.ts:293:26
   let timeout: NodeJS.Timeout | null = null;
   return (...args: Parameters<T>) => {
     if (timeout) clearTimeout(timeout);
-    timeout = setTimeout(() => fn(...args), delay);
+    timeout = setTimeout(() => undefined, delay);
   };
 }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:300:47
 /**
  * Check if ANSI colors are supported in the terminal.
  */
-export function supportsAnsiColors(): boolean {
-  if (typeof process !== "undefined" && process.env) {
-    // Check for common no-color environments
-    if (process.env.NO_COLOR === "1") return false;
-    if (process.env.TERM === "dumb") return false;
-  }
-  
-  // Check if stdout is a TTY (not reliable in all environments)
-  if (typeof process !== "undefined" && process.stdout) {
-    return process.stdout.isTTY === true;
-  }
-  
-  return false;
-}
+export function supportsAnsiColors(): boolean {}
 
 // ── Generic Adapter (Fallback) ────────────────────────────────────────

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:301:54
  * Check if ANSI colors are supported in the terminal.
  */
 export function supportsAnsiColors(): boolean {
-  if (typeof process !== "undefined" && process.env) {
-    // Check for common no-color environments
-    if (process.env.NO_COLOR === "1") return false;
-    if (process.env.TERM === "dumb") return false;
-  }
+  if (typeof process !== "undefined" && process.env) {}
   
   // Check if stdout is a TTY (not reliable in all environments)

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:301:7
  * Check if ANSI colors are supported in the terminal.
  */
 export function supportsAnsiColors(): boolean {
-  if (typeof process !== "undefined" && process.env) {
+  if (false) {
     // Check for common no-color environments
     if (process.env.NO_COLOR === "1") return false;

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:303:9
 export function supportsAnsiColors(): boolean {
   if (typeof process !== "undefined" && process.env) {
     // Check for common no-color environments
-    if (process.env.NO_COLOR === "1") return false;
+    if (true) return false;
     if (process.env.TERM === "dumb") return false;
   }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:303:9
 export function supportsAnsiColors(): boolean {
   if (typeof process !== "undefined" && process.env) {
     // Check for common no-color environments
-    if (process.env.NO_COLOR === "1") return false;
+    if (false) return false;
     if (process.env.TERM === "dumb") return false;
   }

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/base.ts:304:9
   if (typeof process !== "undefined" && process.env) {
     // Check for common no-color environments
     if (process.env.NO_COLOR === "1") return false;
-    if (process.env.TERM === "dumb") return false;
+    if (process.env.TERM !== "dumb") return false;
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:304:9
   if (typeof process !== "undefined" && process.env) {
     // Check for common no-color environments
     if (process.env.NO_COLOR === "1") return false;
-    if (process.env.TERM === "dumb") return false;
+    if (false) return false;
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:308:7
   }
   
   // Check if stdout is a TTY (not reliable in all environments)
-  if (typeof process !== "undefined" && process.stdout) {
+  if (true) {
     return process.stdout.isTTY === true;
   }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:308:7
   }
   
   // Check if stdout is a TTY (not reliable in all environments)
-  if (typeof process !== "undefined" && process.stdout) {
+  if (true && process.stdout) {
     return process.stdout.isTTY === true;
   }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:309:12
   
   // Check if stdout is a TTY (not reliable in all environments)
   if (typeof process !== "undefined" && process.stdout) {
-    return process.stdout.isTTY === true;
+    return false;
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/base.ts:309:12
   
   // Check if stdout is a TTY (not reliable in all environments)
   if (typeof process !== "undefined" && process.stdout) {
-    return process.stdout.isTTY === true;
+    return true;
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:328:22
     super("generic");
   }
   
-  initialize(): void {
-    console.log("[cali-product-workflow] Initialized generic adapter (limited functionality)");
-    super.initialize();
-  }
+  initialize(): void {}
   
   showNotification(message: string, type: NotificationType = "info"): void {

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/base.ts:333:76
     super.initialize();
   }
   
-  showNotification(message: string, type: NotificationType = "info"): void {
-    console.log(`[${type.toUpperCase()}] ${message}`);
-  }
+  showNotification(message: string, type: NotificationType = "info"): void {}
 }
 

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/base.ts:334:21
   }
   
   showNotification(message: string, type: NotificationType = "info"): void {
-    console.log(`[${type.toUpperCase()}] ${message}`);
+    console.log(`[${type.toLowerCase()}] ${message}`);
   }
 }
