[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:156:54
  * @param cli - Optional CLI override (defaults to detected CLI)
  * @returns CLIAdapter instance
  */
-export function createAdapter(cli?: CLI): CLIAdapter {
-  const detected = cli || detectCLI();
-  
-  switch (detected) {
-    case "pi":
-      return createPiAdapter();
-    case "opencode":
-      return createOpenCodeAdapter();
-    case "claude-code":
-      return createClaudeCodeAdapter();
-    case "codex":
-      return createCodexAdapter();
-    default:
-      return makeGenericAdapter();
-  }
-}
+export function createAdapter(cli?: CLI): CLIAdapter {}
 
 /**

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/cli-adapter.ts:157:20
  * @returns CLIAdapter instance
  */
 export function createAdapter(cli?: CLI): CLIAdapter {
-  const detected = cli || detectCLI();
+  const detected = true;
   
   switch (detected) {

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/cli-adapter.ts:157:20
  * @returns CLIAdapter instance
  */
 export function createAdapter(cli?: CLI): CLIAdapter {
-  const detected = cli || detectCLI();
+  const detected = false;
   
   switch (detected) {

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/cli-adapter.ts:160:5
   const detected = cli || detectCLI();
   
   switch (detected) {
-    case "pi":
-      return createPiAdapter();
+    case "pi":
     case "opencode":
       return createOpenCodeAdapter();

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/cli-adapter.ts:162:5
   switch (detected) {
     case "pi":
       return createPiAdapter();
-    case "opencode":
-      return createOpenCodeAdapter();
+    case "opencode":
     case "claude-code":
       return createClaudeCodeAdapter();

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/cli-adapter.ts:162:10
   switch (detected) {
     case "pi":
       return createPiAdapter();
-    case "opencode":
+    case "":
       return createOpenCodeAdapter();
     case "claude-code":

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/cli-adapter.ts:164:5
       return createPiAdapter();
     case "opencode":
       return createOpenCodeAdapter();
-    case "claude-code":
-      return createClaudeCodeAdapter();
+    case "claude-code":
     case "codex":
       return createCodexAdapter();

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/cli-adapter.ts:166:5
       return createOpenCodeAdapter();
     case "claude-code":
       return createClaudeCodeAdapter();
-    case "codex":
-      return createCodexAdapter();
+    case "codex":
     default:
       return makeGenericAdapter();

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/cli-adapter.ts:168:5
       return createClaudeCodeAdapter();
     case "codex":
       return createCodexAdapter();
-    default:
-      return makeGenericAdapter();
+    default:
   }
 }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:176:40
 /**
  * Create the Pi adapter.
  */
-function createPiAdapter(): CLIAdapter {
-  // Lazy import to avoid circular dependencies
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createPiAdapter: makePiAdapter } = require("./pi/index.ts");
-  return makePiAdapter();
-}
+function createPiAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:186:46
 /**
  * Create the OpenCode adapter.
  */
-function createOpenCodeAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createOpenCodeAdapter: makeOpenCodeAdapter } = require("./opencode/index.ts");
-  return makeOpenCodeAdapter();
-}
+function createOpenCodeAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:195:48
 /**
  * Create the Claude Code adapter.
  */
-function createClaudeCodeAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createClaudeCodeAdapter: makeClaudeCodeAdapter } = require("./claude-code/index.ts");
-  return makeClaudeCodeAdapter();
-}
+function createClaudeCodeAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:204:43
 /**
  * Create the Codex adapter.
  */
-function createCodexAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createCodexAdapter: makeCodexAdapter } = require("./codex/index.ts");
-  return makeCodexAdapter();
-}
+function createCodexAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:214:43
  * Create a generic adapter with no-op implementations.
  * Used as fallback when no specific CLI is detected.
  */
-function makeGenericAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createGenericAdapter } = require("./generic.ts");
-  return createGenericAdapter();
-}
+function makeGenericAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:224:55
  * Public factory function for generic adapter.
  * Alias for makeGenericAdapter().
  */
-export function createGenericCLIAdapter(): CLIAdapter {
-  return makeGenericAdapter();
-}
+export function createGenericCLIAdapter(): CLIAdapter {}
 
