[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:27:11
  */
 export const WORKFLOW_COMMANDS: CommandDescriptor[] = [
   {
-    name: "pw-start",
+    name: "",
     description: "Start a new product workflow",
     usage: "/pw-start [name=...] [description=...] [@file]",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:28:18
 export const WORKFLOW_COMMANDS: CommandDescriptor[] = [
   {
     name: "pw-start",
-    description: "Start a new product workflow",
+    description: "",
     usage: "/pw-start [name=...] [description=...] [@file]",
   },

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:33:18
   },
   {
     name: "pw-stop",
-    description: "Stop workflow(s)",
+    description: "",
     usage: "/pw-stop | all | name1 name2",
   },

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:42:11
     usage: "/pw-pause",
   },
   {
-    name: "pw-resume",
+    name: "",
     description: "Resume paused workflow",
     usage: "/pw-resume [name=name]",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:47:11
     usage: "/pw-resume [name=name]",
   },
   {
-    name: "pw-status",
+    name: "",
     description: "Show active workflow status",
     usage: "/pw-status",

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:51:3
     description: "Show active workflow status",
     usage: "/pw-status",
   },
-  {
-    name: "pw-ls",
-    description: "List workflows",
-    usage: "/pw-ls | all | archived | path=DIR",
-  },
+  {},
   {
     name: "pw-setphase",

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:56:3
     description: "List workflows",
     usage: "/pw-ls | all | archived | path=DIR",
   },
-  {
-    name: "pw-setphase",
-    description: "Jump to phase",
-    usage: "/pw-setphase phase=N | phasename=Name",
-  },
+  {},
   {
     name: "pw-next",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:57:11
     usage: "/pw-ls | all | archived | path=DIR",
   },
   {
-    name: "pw-setphase",
+    name: "",
     description: "Jump to phase",
     usage: "/pw-setphase phase=N | phasename=Name",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:58:18
   },
   {
     name: "pw-setphase",
-    description: "Jump to phase",
+    description: "",
     usage: "/pw-setphase phase=N | phasename=Name",
   },

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:68:18
   },
   {
     name: "pw-complete",
-    description: "Mark active workflow complete",
+    description: "",
     usage: "/pw-complete",
   },

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:71:3
     description: "Mark active workflow complete",
     usage: "/pw-complete",
   },
-  {
-    name: "pw-goto",
-    description: "Go to a workflow",
-    usage: "/pw-goto [name=name]",
-  },
+  {},
   {
     name: "pw-rename",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:72:11
     usage: "/pw-complete",
   },
   {
-    name: "pw-goto",
+    name: "",
     description: "Go to a workflow",
     usage: "/pw-goto [name=name]",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:74:12
   {
     name: "pw-goto",
     description: "Go to a workflow",
-    usage: "/pw-goto [name=name]",
+    usage: "",
   },
   {

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:77:11
     usage: "/pw-goto [name=name]",
   },
   {
-    name: "pw-rename",
+    name: "",
     description: "Rename active workflow",
     usage: "/pw-rename novo-nome | name=novo-nome",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:88:18
   },
   {
     name: "pw-archive",
-    description: "Archive workflows",
+    description: "",
     usage: "/pw-archive | /pw-archive name=X | /pw-archive purge",
   },

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:93:18
   },
   {
     name: "pw-unarchive",
-    description: "Unarchive a workflow",
+    description: "",
     usage: "/pw-unarchive name=<workflow>",
   },

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:100:13
     name: "pw-todo",
     description: "Manage phase todos",
     usage: "/pw-todo | add <task> | complete <id>",
-    piOnly: true,
+    piOnly: false,
   },
   {

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:102:3
     usage: "/pw-todo | add <task> | complete <id>",
     piOnly: true,
   },
-  {
-    name: "pw-inbox",
-    description: "Manage workflow inbox",
-    usage: "/pw-inbox | add <text> | remove <text> | clear",
-    piOnly: true,
-  },
+  {},
 ];
 

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:103:11
     piOnly: true,
   },
   {
-    name: "pw-inbox",
+    name: "",
     description: "Manage workflow inbox",
     usage: "/pw-inbox | add <text> | remove <text> | clear",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:105:12
   {
     name: "pw-inbox",
     description: "Manage workflow inbox",
-    usage: "/pw-inbox | add <text> | remove <text> | clear",
+    usage: "",
     piOnly: true,
   },

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:106:13
     name: "pw-inbox",
     description: "Manage workflow inbox",
     usage: "/pw-inbox | add <text> | remove <text> | clear",
-    piOnly: true,
+    piOnly: false,
   },
 ];

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:148:72
 /**
  * Get the appropriate command registration system for the current CLI.
  */
-export function getCommandSystem(cli?: CLI): CommandRegistrationSystem {
-  const detected = cli || detectCLI();
-  
-  switch (detected) {
-    case "pi":
-      return getPiCommandSystem();
-    case "opencode":
-      return getOpenCodeCommandSystem();
-    case "claude-code":
-      return getClaudeCodeCommandSystem();
-    case "codex":
-      return getCodexCommandSystem();
-    default:
-      return getGenericCommandSystem();
-  }
-}
+export function getCommandSystem(cli?: CLI): CommandRegistrationSystem {}
 
 // ── Pi Command System ─────────────────────────────────────────────────

[NoCoverage] LogicalOperator
cali-product-workflow/adapters/commands/dispatcher.ts:149:20
  * Get the appropriate command registration system for the current CLI.
  */
 export function getCommandSystem(cli?: CLI): CommandRegistrationSystem {
-  const detected = cli || detectCLI();
+  const detected = cli && detectCLI();
   
   switch (detected) {

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:149:20
  * Get the appropriate command registration system for the current CLI.
  */
 export function getCommandSystem(cli?: CLI): CommandRegistrationSystem {
-  const detected = cli || detectCLI();
+  const detected = false;
   
   switch (detected) {

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:152:5
   const detected = cli || detectCLI();
   
   switch (detected) {
-    case "pi":
-      return getPiCommandSystem();
+    case "pi":
     case "opencode":
       return getOpenCodeCommandSystem();

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:154:5
   switch (detected) {
     case "pi":
       return getPiCommandSystem();
-    case "opencode":
-      return getOpenCodeCommandSystem();
+    case "opencode":
     case "claude-code":
       return getClaudeCodeCommandSystem();

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:154:10
   switch (detected) {
     case "pi":
       return getPiCommandSystem();
-    case "opencode":
+    case "":
       return getOpenCodeCommandSystem();
     case "claude-code":

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:156:5
       return getPiCommandSystem();
     case "opencode":
       return getOpenCodeCommandSystem();
-    case "claude-code":
-      return getClaudeCodeCommandSystem();
+    case "claude-code":
     case "codex":
       return getCodexCommandSystem();

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:158:5
       return getOpenCodeCommandSystem();
     case "claude-code":
       return getClaudeCodeCommandSystem();
-    case "codex":
-      return getCodexCommandSystem();
+    case "codex":
     default:
       return getGenericCommandSystem();

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:160:5
       return getClaudeCodeCommandSystem();
     case "codex":
       return getCodexCommandSystem();
-    default:
-      return getGenericCommandSystem();
+    default:
   }
 }

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:171:39
   return {
     cli: "pi" as CLI,
     
-    supportsNativeCommands(): boolean {
-      return true;
-    },
+    supportsNativeCommands(): boolean {},
     
     registerAll(): CommandDescriptor[] {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:172:14
     cli: "pi" as CLI,
     
     supportsNativeCommands(): boolean {
-      return true;
+      return false;
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:175:40
       return true;
     },
     
-    registerAll(): CommandDescriptor[] {
-      // Pi uses native command registration via ExtensionAPI
-      // This is handled in commands.ts with pi.registerCommand()
-      return WORKFLOW_COMMANDS;
-    },
+    registerAll(): CommandDescriptor[] {},
     
     registerOne(descriptor: CommandDescriptor): boolean {

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:181:57
       return WORKFLOW_COMMANDS;
     },
     
-    registerOne(descriptor: CommandDescriptor): boolean {
-      // Pi handles this via registerCommands() in commands.ts
-      return true;
-    },
+    registerOne(descriptor: CommandDescriptor): boolean {},
     
     getCommandPrefix(): string {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:183:14
     
     registerOne(descriptor: CommandDescriptor): boolean {
       // Pi handles this via registerCommands() in commands.ts
-      return true;
+      return false;
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:186:32
       return true;
     },
     
-    getCommandPrefix(): string {
-      return "/";
-    },
+    getCommandPrefix(): string {},
     
     generateCommandFiles(): Array<{ path: string; content: string }> {

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:190:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      // Pi doesn't use file-based commands
-      return [];
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrayDeclaration
cali-product-workflow/adapters/commands/dispatcher.ts:192:14
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
       // Pi doesn't use file-based commands
-      return [];
+      return ["Stryker was here"];
     },
   };

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:203:39
   return {
     cli: "opencode" as CLI,
     
-    supportsNativeCommands(): boolean {
-      return false; // OpenCode uses skill files
-    },
+    supportsNativeCommands(): boolean {},
     
     registerAll(): CommandDescriptor[] {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:204:14
     cli: "opencode" as CLI,
     
     supportsNativeCommands(): boolean {
-      return false; // OpenCode uses skill files
+      return true; // OpenCode uses skill files
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:207:40
       return false; // OpenCode uses skill files
     },
     
-    registerAll(): CommandDescriptor[] {
-      // OpenCode uses skills/ directory
-      return WORKFLOW_COMMANDS;
-    },
+    registerAll(): CommandDescriptor[] {},
     
     registerOne(_descriptor: CommandDescriptor): boolean {

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:212:58
       return WORKFLOW_COMMANDS;
     },
     
-    registerOne(_descriptor: CommandDescriptor): boolean {
-      // Commands are file-based
-      return true;
-    },
+    registerOne(_descriptor: CommandDescriptor): boolean {},
     
     getCommandPrefix(): string {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:214:14
     
     registerOne(_descriptor: CommandDescriptor): boolean {
       // Commands are file-based
-      return true;
+      return false;
     },
     

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:218:14
     },
     
     getCommandPrefix(): string {
-      return "/";
+      return "";
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:221:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name}.md`,
-        content: generateOpenCodeSkillFile(cmd),
-      }));
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrowFunction
cali-product-workflow/adapters/commands/dispatcher.ts:222:36
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name}.md`,
-        content: generateOpenCodeSkillFile(cmd),
-      }));
+      return WORKFLOW_COMMANDS.map(() => undefined);
     },
   };

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:230:68
   };
 }
 
-function generateOpenCodeSkillFile(cmd: CommandDescriptor): string {
-  return `---
-name: ${cmd.name}
-description: ${cmd.description}
----
-
-// Usage: ${cmd.usage || cmd.description}
-
-/skill:cali-product-workflow
-
-// Command: ${cmd.name}
-// This skill delegates to the product-workflow skill
-${cmd.name} {args}
-`;
-}
+function generateOpenCodeSkillFile(cmd: CommandDescriptor): string {}
 
 // ── Claude Code Command System ────────────────────────────────────────

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:231:10
 }
 
 function generateOpenCodeSkillFile(cmd: CommandDescriptor): string {
-  return `---
-name: ${cmd.name}
-description: ${cmd.description}
----
-
-// Usage: ${cmd.usage || cmd.description}
-
-/skill:cali-product-workflow
-
-// Command: ${cmd.name}
-// This skill delegates to the product-workflow skill
-${cmd.name} {args}
-`;
+  return ``;
 }
 

[NoCoverage] LogicalOperator
cali-product-workflow/adapters/commands/dispatcher.ts:236:13
 description: ${cmd.description}
 ---
 
-// Usage: ${cmd.usage || cmd.description}
+// Usage: ${cmd.usage && cmd.description}
 
 /skill:cali-product-workflow

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:236:13
 description: ${cmd.description}
 ---
 
-// Usage: ${cmd.usage || cmd.description}
+// Usage: ${false}
 
 /skill:cali-product-workflow

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:252:39
   return {
     cli: "claude-code" as CLI,
     
-    supportsNativeCommands(): boolean {
-      return false; // Claude Code uses skills/
-    },
+    supportsNativeCommands(): boolean {},
     
     registerAll(): CommandDescriptor[] {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:253:14
     cli: "claude-code" as CLI,
     
     supportsNativeCommands(): boolean {
-      return false; // Claude Code uses skills/
+      return true; // Claude Code uses skills/
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:256:40
       return false; // Claude Code uses skills/
     },
     
-    registerAll(): CommandDescriptor[] {
-      return WORKFLOW_COMMANDS;
-    },
+    registerAll(): CommandDescriptor[] {},
     
     registerOne(_descriptor: CommandDescriptor): boolean {

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:260:58
       return WORKFLOW_COMMANDS;
     },
     
-    registerOne(_descriptor: CommandDescriptor): boolean {
-      return true;
-    },
+    registerOne(_descriptor: CommandDescriptor): boolean {},
     
     getCommandPrefix(): string {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:261:14
     },
     
     registerOne(_descriptor: CommandDescriptor): boolean {
-      return true;
+      return false;
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:268:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name}.md`,
-        content: generateClaudeCodeSkillFile(cmd),
-      }));
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrowFunction
cali-product-workflow/adapters/commands/dispatcher.ts:269:36
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name}.md`,
-        content: generateClaudeCodeSkillFile(cmd),
-      }));
+      return WORKFLOW_COMMANDS.map(() => undefined);
     },
   };

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:277:70
   };
 }
 
-function generateClaudeCodeSkillFile(cmd: CommandDescriptor): string {
-  return `---
-name: ${cmd.name}
-description: ${cmd.description}
----
-
-// Usage: ${cmd.usage || cmd.description}
-${cmd.name} {args}
-`;
-}
+function generateClaudeCodeSkillFile(cmd: CommandDescriptor): string {}
 
 // ── Codex Command System ──────────────────────────────────────────────

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:283:13
 description: ${cmd.description}
 ---
 
-// Usage: ${cmd.usage || cmd.description}
+// Usage: ${true}
 ${cmd.name} {args}
 `;

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:294:39
   return {
     cli: "codex" as CLI,
     
-    supportsNativeCommands(): boolean {
-      return false; // Codex uses commands/ directory
-    },
+    supportsNativeCommands(): boolean {},
     
     registerAll(): CommandDescriptor[] {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:295:14
     cli: "codex" as CLI,
     
     supportsNativeCommands(): boolean {
-      return false; // Codex uses commands/ directory
+      return true; // Codex uses commands/ directory
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:310:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `commands/${cmd.name}.md`,
-        content: generateCodexCommandFile(cmd),
-      }));
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrowFunction
cali-product-workflow/adapters/commands/dispatcher.ts:311:36
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `commands/${cmd.name}.md`,
-        content: generateCodexCommandFile(cmd),
-      }));
+      return WORKFLOW_COMMANDS.map(() => undefined);
     },
   };

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:311:44
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `commands/${cmd.name}.md`,
-        content: generateCodexCommandFile(cmd),
-      }));
+      return WORKFLOW_COMMANDS.map(cmd => ({}));
     },
   };

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:319:67
   };
 }
 
-function generateCodexCommandFile(cmd: CommandDescriptor): string {
-  return `---
-name: ${cmd.name}
-description: ${cmd.description}
----
-
-@agent
-// Usage: ${cmd.usage || cmd.description}
-${cmd.name} {args}
-`;
-}
+function generateCodexCommandFile(cmd: CommandDescriptor): string {}
 
 // ── Generic Command System (Fallback) ─────────────────────────────────

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:326:13
 ---
 
 @agent
-// Usage: ${cmd.usage || cmd.description}
+// Usage: ${true}
 ${cmd.name} {args}
 `;

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:326:13
 ---
 
 @agent
-// Usage: ${cmd.usage || cmd.description}
+// Usage: ${false}
 ${cmd.name} {args}
 `;

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:334:10
 // ── Generic Command System (Fallback) ─────────────────────────────────
 
 function getGenericCommandSystem(): CommandRegistrationSystem {
-  return {
-    cli: "generic" as CLI,
-    
-    supportsNativeCommands(): boolean {
-      return false;
-    },
-    
-    registerAll(): CommandDescriptor[] {
-      // No commands registered in generic mode
-      return [];
-    },
-    
-    registerOne(_descriptor: CommandDescriptor): boolean {
-      return false;
-    },
-    
-    getCommandPrefix(): string {
-      return "/";
-    },
-    
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return [];
-    },
-  };
+  return {};
 }
 

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:337:39
   return {
     cli: "generic" as CLI,
     
-    supportsNativeCommands(): boolean {
-      return false;
-    },
+    supportsNativeCommands(): boolean {},
     
     registerAll(): CommandDescriptor[] {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:338:14
     cli: "generic" as CLI,
     
     supportsNativeCommands(): boolean {
-      return false;
+      return true;
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:341:40
       return false;
     },
     
-    registerAll(): CommandDescriptor[] {
-      // No commands registered in generic mode
-      return [];
-    },
+    registerAll(): CommandDescriptor[] {},
     
     registerOne(_descriptor: CommandDescriptor): boolean {

[NoCoverage] ArrayDeclaration
cali-product-workflow/adapters/commands/dispatcher.ts:343:14
     
     registerAll(): CommandDescriptor[] {
       // No commands registered in generic mode
-      return [];
+      return ["Stryker was here"];
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:346:58
       return [];
     },
     
-    registerOne(_descriptor: CommandDescriptor): boolean {
-      return false;
-    },
+    registerOne(_descriptor: CommandDescriptor): boolean {},
     
     getCommandPrefix(): string {

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:347:14
     },
     
     registerOne(_descriptor: CommandDescriptor): boolean {
-      return false;
+      return true;
     },
     

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:354:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return [];
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrayDeclaration
cali-product-workflow/adapters/commands/dispatcher.ts:355:14
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return [];
+      return ["Stryker was here"];
     },
   };

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:367:71
  * @param baseDir - Base directory to write command files
  * @param cli - Target CLI (defaults to detected)
  */
-export function installCommandFiles(baseDir: string, cli?: CLI): void {
-  const { writeFileSync, mkdirSync, existsSync } = require("node:fs");
-  
-  const system = getCommandSystem(cli);
-  const files = system.generateCommandFiles();
-  
-  for (const file of files) {
-    const fullPath = `${baseDir}/${file.path}`;
-    const dir = fullPath.substring(0, fullPath.lastIndexOf("/"));
-    
-    if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
-    }
-    
-    writeFileSync(fullPath, file.content, "utf8");
-    console.log(`[cali-product-workflow] Installed: ${file.path}`);
-  }
-}
+export function installCommandFiles(baseDir: string, cli?: CLI): void {}

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:373:29
   const system = getCommandSystem(cli);
   const files = system.generateCommandFiles();
   
-  for (const file of files) {
-    const fullPath = `${baseDir}/${file.path}`;
-    const dir = fullPath.substring(0, fullPath.lastIndexOf("/"));
-    
-    if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
-    }
-    
-    writeFileSync(fullPath, file.content, "utf8");
-    console.log(`[cali-product-workflow] Installed: ${file.path}`);
-  }
+  for (const file of files) {}
 }

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:374:22
   const files = system.generateCommandFiles();
   
   for (const file of files) {
-    const fullPath = `${baseDir}/${file.path}`;
+    const fullPath = ``;
     const dir = fullPath.substring(0, fullPath.lastIndexOf("/"));
     

[NoCoverage] MethodExpression
cali-product-workflow/adapters/commands/dispatcher.ts:375:17
   
   for (const file of files) {
     const fullPath = `${baseDir}/${file.path}`;
-    const dir = fullPath.substring(0, fullPath.lastIndexOf("/"));
+    const dir = fullPath;
     
     if (!existsSync(dir)) {

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:377:27
     const fullPath = `${baseDir}/${file.path}`;
     const dir = fullPath.substring(0, fullPath.lastIndexOf("/"));
     
-    if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
-    }
+    if (!existsSync(dir)) {}
     
     writeFileSync(fullPath, file.content, "utf8");

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:377:9
     const fullPath = `${baseDir}/${file.path}`;
     const dir = fullPath.substring(0, fullPath.lastIndexOf("/"));
     
-    if (!existsSync(dir)) {
+    if (true) {
       mkdirSync(dir, { recursive: true });
     }

[NoCoverage] BooleanLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:378:35
     const dir = fullPath.substring(0, fullPath.lastIndexOf("/"));
     
     if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
+      mkdirSync(dir, { recursive: false });
     }
     
