[Survived] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:71:36
   private _adapter: CLIAdapter;
   private _listeners: Map<EventType, Set<(...args: unknown[]) => void>> = new Map();
   
-  constructor(adapter: CLIAdapter) {
-    this._adapter = adapter;
-    this._registerAdapterHandlers();
-  }
+  constructor(adapter: CLIAdapter) {}
   
   /**

[Survived] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:80:44
    * Register adapter's handlers for events.
    * This wires the adapter to the dispatcher.
    */
-  private _registerAdapterHandlers(): void {
-    // Tool call events
-    this._adapter.onToolCall((tool: string, input: unknown) => {
-      this._emit("tool_call", { tool, input });
-    });
-    
-    // Session start events
-    this._adapter.onSessionStart((cwd: string) => {
-      this._emit("session_start", { cwd });
-    });
-    
-    // Turn end events
-    this._adapter.onTurnEnd((ctx: { cwd: string; sessionId?: string }) => {
-      this._emit("turn_end", ctx);
-    });
-    
-    // Input events
-    this._adapter.onInput((text: string, ctx: { cwd: string; sessionId?: string }) => {
-      this._emit("input", { text, ...ctx });
-    });
-  }
+  private _registerAdapterHandlers(): void {}
   
   /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:82:64
    */
   private _registerAdapterHandlers(): void {
     // Tool call events
-    this._adapter.onToolCall((tool: string, input: unknown) => {
-      this._emit("tool_call", { tool, input });
-    });
+    this._adapter.onToolCall((tool: string, input: unknown) => {});
     
     // Session start events

[NoCoverage] ObjectLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:83:31
   private _registerAdapterHandlers(): void {
     // Tool call events
     this._adapter.onToolCall((tool: string, input: unknown) => {
-      this._emit("tool_call", { tool, input });
+      this._emit("tool_call", {});
     });
     

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:87:51
     });
     
     // Session start events
-    this._adapter.onSessionStart((cwd: string) => {
-      this._emit("session_start", { cwd });
-    });
+    this._adapter.onSessionStart((cwd: string) => {});
     
     // Turn end events

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:92:75
     });
     
     // Turn end events
-    this._adapter.onTurnEnd((ctx: { cwd: string; sessionId?: string }) => {
-      this._emit("turn_end", ctx);
-    });
+    this._adapter.onTurnEnd((ctx: { cwd: string; sessionId?: string }) => {});
     
     // Input events

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:93:18
     
     // Turn end events
     this._adapter.onTurnEnd((ctx: { cwd: string; sessionId?: string }) => {
-      this._emit("turn_end", ctx);
+      this._emit("", ctx);
     });
     

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:97:87
     });
     
     // Input events
-    this._adapter.onInput((text: string, ctx: { cwd: string; sessionId?: string }) => {
-      this._emit("input", { text, ...ctx });
-    });
+    this._adapter.onInput((text: string, ctx: { cwd: string; sessionId?: string }) => {});
   }
   

[NoCoverage] ObjectLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:98:27
     
     // Input events
     this._adapter.onInput((text: string, ctx: { cwd: string; sessionId?: string }) => {
-      this._emit("input", { text, ...ctx });
+      this._emit("input", {});
     });
   }

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:98:18
     
     // Input events
     this._adapter.onInput((text: string, ctx: { cwd: string; sessionId?: string }) => {
-      this._emit("input", { text, ...ctx });
+      this._emit("", { text, ...ctx });
     });
   }

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:108:74
    * @param handler - Callback function
    * @returns Unsubscribe function
    */
-  on(type: EventType, handler: (...args: unknown[]) => void): () => void {
-    if (!this._listeners.has(type)) {
-      this._listeners.set(type, new Set());
-    }
-    this._listeners.get(type)!.add(handler);
-    
-    // Return unsubscribe function
-    return () => {
-      this._listeners.get(type)?.delete(handler);
-    };
-  }
+  on(type: EventType, handler: (...args: unknown[]) => void): () => void {}
   
   /**
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
extensions/cali-product-workflow/adapters/event-dispatcher.ts:109:9
    * @returns Unsubscribe function
    */
   on(type: EventType, handler: (...args: unknown[]) => void): () => void {
-    if (!this._listeners.has(type)) {
+    if (true) {
       this._listeners.set(type, new Set());
     }
killedBy: Event Dispatcher should support multiple listeners on same event
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:109:9
    * @returns Unsubscribe function
    */
   on(type: EventType, handler: (...args: unknown[]) => void): () => void {
-    if (!this._listeners.has(type)) {
+    if (this._listeners.has(type)) {
       this._listeners.set(type, new Set());
     }
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:115:18
     this._listeners.get(type)!.add(handler);
     
     // Return unsubscribe function
-    return () => {
-      this._listeners.get(type)?.delete(handler);
-    };
+    return () => {};
   }
   
killedBy: Event Dispatcher should unsubscribe handlers
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Survived] OptionalChaining
extensions/cali-product-workflow/adapters/event-dispatcher.ts:116:7
     
     // Return unsubscribe function
     return () => {
-      this._listeners.get(type)?.delete(handler);
+      this._listeners.get(type).delete(handler);
     };
   }

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:125:55
    * @param type - Event type
    * @param data - Event data
    */
-  private _emit(type: EventType, data: unknown): void {
-    const listeners = this._listeners.get(type);
-    if (listeners) {
-      for (const listener of listeners) {
-        try {
-          listener(data);
-        } catch (err) {
-          console.error(`[EventDispatcher] Error in ${type} handler:`, err);
-        }
-      }
-    }
-  }
+  private _emit(type: EventType, data: unknown): void {}
   
   /**
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:127:20
    */
   private _emit(type: EventType, data: unknown): void {
     const listeners = this._listeners.get(type);
-    if (listeners) {
-      for (const listener of listeners) {
-        try {
-          listener(data);
-        } catch (err) {
-          console.error(`[EventDispatcher] Error in ${type} handler:`, err);
-        }
-      }
-    }
+    if (listeners) {}
   }
   
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
extensions/cali-product-workflow/adapters/event-dispatcher.ts:127:9
    */
   private _emit(type: EventType, data: unknown): void {
     const listeners = this._listeners.get(type);
-    if (listeners) {
+    if (true) {
       for (const listener of listeners) {
         try {
killedBy: Event Dispatcher should clear listeners on dispose
statusReason: listeners is not iterable

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:128:41
   private _emit(type: EventType, data: unknown): void {
     const listeners = this._listeners.get(type);
     if (listeners) {
-      for (const listener of listeners) {
-        try {
-          listener(data);
-        } catch (err) {
-          console.error(`[EventDispatcher] Error in ${type} handler:`, err);
-        }
-      }
+      for (const listener of listeners) {}
     }
   }
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:129:13
     const listeners = this._listeners.get(type);
     if (listeners) {
       for (const listener of listeners) {
-        try {
-          listener(data);
-        } catch (err) {
+        try {} catch (err) {
           console.error(`[EventDispatcher] Error in ${type} handler:`, err);
         }
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:131:23
       for (const listener of listeners) {
         try {
           listener(data);
-        } catch (err) {
-          console.error(`[EventDispatcher] Error in ${type} handler:`, err);
-        }
+        } catch (err) {}
       }
     }
killedBy: Event Dispatcher should not throw when handler errors
statusReason: expected "error" to be called at least once

[Survived] StringLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:132:25
         try {
           listener(data);
         } catch (err) {
-          console.error(`[EventDispatcher] Error in ${type} handler:`, err);
+          console.error(``, err);
         }
       }

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:141:63
   /**
    * Dispatch a session_start event.
    */
-  dispatchSessionStart(cwd: string, sessionId?: string): void {
-    this._emit("session_start", { cwd, sessionId });
-  }
+  dispatchSessionStart(cwd: string, sessionId?: string): void {}
   
   /**
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:148:69
   /**
    * Dispatch a tool_call event.
    */
-  dispatchToolCall(tool: string, input: unknown, cwd: string): void {
-    this._emit("tool_call", { tool, input, cwd });
-  }
+  dispatchToolCall(tool: string, input: unknown, cwd: string): void {}
   
   /**
killedBy: Event Dispatcher should emit tool_call with tool and input
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:149:16
    * Dispatch a tool_call event.
    */
   dispatchToolCall(tool: string, input: unknown, cwd: string): void {
-    this._emit("tool_call", { tool, input, cwd });
+    this._emit("", { tool, input, cwd });
   }
   
killedBy: Event Dispatcher should emit tool_call with tool and input
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:155:58
   /**
    * Dispatch a turn_end event.
    */
-  dispatchTurnEnd(cwd: string, sessionId?: string): void {
-    this._emit("turn_end", { cwd, sessionId });
-  }
+  dispatchTurnEnd(cwd: string, sessionId?: string): void {}
   
   /**
killedBy: Event Dispatcher should emit turn_end with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"cwd": "/cwd"} ]

Number of calls: 0

[Killed] ObjectLiteral
extensions/cali-product-workflow/adapters/event-dispatcher.ts:156:28
    * Dispatch a turn_end event.
    */
   dispatchTurnEnd(cwd: string, sessionId?: string): void {
-    this._emit("turn_end", { cwd, sessionId });
+    this._emit("turn_end", {});
   }
   
killedBy: Event Dispatcher should emit turn_end with cwd
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"cwd": "/cwd"} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:162:70
   /**
    * Dispatch an input event.
    */
-  dispatchInput(text: string, cwd: string, sessionId?: string): void {
-    this._emit("input", { text, cwd, sessionId });
-  }
+  dispatchInput(text: string, cwd: string, sessionId?: string): void {}
   
   /**
killedBy: Event Dispatcher should emit input with text and sessionId
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:169:59
   /**
    * Dispatch an agent_end event.
    */
-  dispatchAgentEnd(cwd: string, sessionId?: string): void {
-    this._emit("agent_end", { cwd, sessionId });
-  }
+  dispatchAgentEnd(cwd: string, sessionId?: string): void {}
   
   /**
killedBy: Event Dispatcher should emit agent_end with sessionId
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:176:29
   /**
    * Get the adapter this dispatcher uses.
    */
-  get adapter(): CLIAdapter {
-    return this._adapter;
-  }
+  get adapter(): CLIAdapter {}
   
   /**

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:183:19
   /**
    * Dispose of the dispatcher.
    */
-  dispose(): void {
-    this._listeners.clear();
-  }
+  dispose(): void {}
 }
 
killedBy: Event Dispatcher should clear listeners on dispose
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/event-dispatcher.ts:194:77
  * @param adapter - CLI adapter instance
  * @returns EventDispatcher instance
  */
-export function createEventDispatcher(adapter: CLIAdapter): EventDispatcher {
-  return new EventDispatcher(adapter);
-}
+export function createEventDispatcher(adapter: CLIAdapter): EventDispatcher {}
killedBy: Event Dispatcher should emit session_start with cwd
statusReason: Cannot read properties of undefined (reading 'on')
