[Killed] StringLiteral
extensions/cali-product-workflow/adapters/generic.ts:14:24
 import type { CommandRegistration, ToolDefinition } from "./cli-adapter";
 
 export class GenericAdapter extends BaseAdapter {
-  readonly name: CLI = "generic";
+  readonly name: CLI = "";
   
   private _eventDispatcher?: EventDispatcher;
killedBy: Generic Adapter should have correct name
statusReason: expected '' to be 'generic' // Object.is equality

[Survived] StringLiteral
extensions/cali-product-workflow/adapters/generic.ts:19:11
   private _eventDispatcher?: EventDispatcher;
   
   constructor() {
-    super("generic");
+    super("");
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/generic.ts:25:57
   /**
    * Set an event dispatcher for this adapter.
    */
-  setEventDispatcher(dispatcher: EventDispatcher): void {
-    this._eventDispatcher = dispatcher;
-  }
+  setEventDispatcher(dispatcher: EventDispatcher): void {}
 
   /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/generic.ts:33:30
    * Set the API reference and ensure initialization.
    * Mirrors PiAdapter behavior for consistency.
    */
-  setAPI(api: unknown): void {
-    this.initialize();
-  }
+  setAPI(api: unknown): void {}
 
   initialize(): void {

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/generic.ts:42:45
     super.initialize();
   }
   
-  registerCommands(): CommandRegistration[] {
-    // Generic adapter doesn't register commands by default
-    // Subclasses should override if they support command registration
-    return [];
-  }
+  registerCommands(): CommandRegistration[] {}
   
   getAvailableTools(): ToolDefinition[] {
killedBy: Generic Adapter should return empty commands array
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/generic.ts:48:41
     return [];
   }
   
-  getAvailableTools(): ToolDefinition[] {
-    // Basic tools available in all environments
-    return [
-      { name: "read", description: "Read file contents" },
-      { name: "write", description: "Write content to file" },
-      { name: "bash", description: "Execute shell commands" },
-      { name: "edit", description: "Edit existing files" },
-    ];
-  }
+  getAvailableTools(): ToolDefinition[] {}
   
   showNotification(message: string, type: "info" | "warning" | "error" | "success" = "info"): void {
killedBy: Generic Adapter should return 4 basic tools with correct names
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
extensions/cali-product-workflow/adapters/generic.ts:52:15
     // Basic tools available in all environments
     return [
       { name: "read", description: "Read file contents" },
-      { name: "write", description: "Write content to file" },
+      { name: "", description: "Write content to file" },
       { name: "bash", description: "Execute shell commands" },
       { name: "edit", description: "Edit existing files" },
killedBy: Generic Adapter should return 4 basic tools with correct names
statusReason: expected [ 'read', '', 'bash', 'edit' ] to include 'write'

[Killed] ObjectLiteral
extensions/cali-product-workflow/adapters/generic.ts:53:7
     return [
       { name: "read", description: "Read file contents" },
       { name: "write", description: "Write content to file" },
-      { name: "bash", description: "Execute shell commands" },
+      {},
       { name: "edit", description: "Edit existing files" },
     ];
killedBy: Generic Adapter should return 4 basic tools with correct names
statusReason: expected [ 'read', 'write', undefined, 'edit' ] to include 'bash'

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/generic.ts:58:100
     ];
   }
   
-  showNotification(message: string, type: "info" | "warning" | "error" | "success" = "info"): void {
-    console.log(`[${type.toUpperCase()}] ${message}`);
-  }
+  showNotification(message: string, type: "info" | "warning" | "error" | "success" = "info"): void {}
 }
 
killedBy: Generic Adapter should format notifications with type prefix
statusReason: expected "log" to be called with arguments: [ '[INFO] hello' ]

Number of calls: 0

[Killed] MethodExpression
extensions/cali-product-workflow/adapters/generic.ts:59:21
   }
   
   showNotification(message: string, type: "info" | "warning" | "error" | "success" = "info"): void {
-    console.log(`[${type.toUpperCase()}] ${message}`);
+    console.log(`[${type.toLowerCase()}] ${message}`);
   }
 }
killedBy: Generic Adapter should format notifications with type prefix
statusReason: expected "log" to be called with arguments: [ '[INFO] hello' ]

Received:

  1st log call:

  [
-   "[INFO] hello",

[Killed] BlockStatement
extensions/cali-product-workflow/adapters/generic.ts:64:56
 }
 
 // Factory function for lazy loading
-export function createGenericAdapter(): GenericAdapter {
-  return new GenericAdapter();
-}
+export function createGenericAdapter(): GenericAdapter {}
killedBy: Generic Adapter should have correct name
statusReason: Cannot read properties of undefined (reading 'name')
