[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:70:58
  * Detect the UI fallback level based on environment.
  * Higher levels are preferred (native > ansi > plain > silent).
  */
-export function detectUIFallbackLevel(): UIFallbackLevel {
-  // Check for NO_COLOR environment variable
-  if (typeof process !== "undefined" && process.env?.NO_COLOR === "1") {
-    return "plain";
-  }
-  
-  // Check for dumb terminal
-  if (typeof process !== "undefined" && process.env?.TERM === "dumb") {
-    return "plain";
-  }
-  
-  // Check if we can write to stdout
-  if (typeof process !== "undefined" && process.stdout) {
-    // If stdout is a TTY, we can use ANSI
-    if (process.stdout.isTTY) {
-      return "ansi";
-    }
-    // If stdout is not a TTY but exists, we can still use plain output
-    return "plain";
-  }
-  
-  // Silent fallback for environments without stdout
-  return "silent";
-}
+export function detectUIFallbackLevel(): UIFallbackLevel {}
 
 // ── ANSI Color Utilities ─────────────────────────────────────────────

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:72:41
  */
 export function detectUIFallbackLevel(): UIFallbackLevel {
   // Check for NO_COLOR environment variable
-  if (typeof process !== "undefined" && process.env?.NO_COLOR === "1") {
+  if (typeof process !== "undefined" && true) {
     return "plain";
   }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:72:7
  */
 export function detectUIFallbackLevel(): UIFallbackLevel {
   // Check for NO_COLOR environment variable
-  if (typeof process !== "undefined" && process.env?.NO_COLOR === "1") {
+  if (true) {
     return "plain";
   }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:77:7
   }
   
   // Check for dumb terminal
-  if (typeof process !== "undefined" && process.env?.TERM === "dumb") {
+  if (true) {
     return "plain";
   }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:77:7
   }
   
   // Check for dumb terminal
-  if (typeof process !== "undefined" && process.env?.TERM === "dumb") {
+  if (true && process.env?.TERM === "dumb") {
     return "plain";
   }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:82:57
   }
   
   // Check if we can write to stdout
-  if (typeof process !== "undefined" && process.stdout) {
-    // If stdout is a TTY, we can use ANSI
-    if (process.stdout.isTTY) {
-      return "ansi";
-    }
-    // If stdout is not a TTY but exists, we can still use plain output
-    return "plain";
-  }
+  if (typeof process !== "undefined" && process.stdout) {}
   
   // Silent fallback for environments without stdout

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:82:7
   }
   
   // Check if we can write to stdout
-  if (typeof process !== "undefined" && process.stdout) {
+  if (false) {
     // If stdout is a TTY, we can use ANSI
     if (process.stdout.isTTY) {

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:84:9
   // Check if we can write to stdout
   if (typeof process !== "undefined" && process.stdout) {
     // If stdout is a TTY, we can use ANSI
-    if (process.stdout.isTTY) {
+    if (true) {
       return "ansi";
     }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:84:31
   // Check if we can write to stdout
   if (typeof process !== "undefined" && process.stdout) {
     // If stdout is a TTY, we can use ANSI
-    if (process.stdout.isTTY) {
-      return "ansi";
-    }
+    if (process.stdout.isTTY) {}
     // If stdout is not a TTY but exists, we can still use plain output
     return "plain";

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/ui-adapter.ts:85:14
   if (typeof process !== "undefined" && process.stdout) {
     // If stdout is a TTY, we can use ANSI
     if (process.stdout.isTTY) {
-      return "ansi";
+      return "";
     }
     // If stdout is not a TTY but exists, we can still use plain output

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/ui-adapter.ts:92:10
   }
   
   // Silent fallback for environments without stdout
-  return "silent";
+  return "";
 }
 

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:135:63
 /**
  * Map notification type to ANSI color.
  */
-function getNotificationColor(type: NotificationType): string {
-  return AnsiColors[type] || AnsiColors.info;
-}
+function getNotificationColor(type: NotificationType): string {}
 
 /**

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:136:10
  * Map notification type to ANSI color.
  */
 function getNotificationColor(type: NotificationType): string {
-  return AnsiColors[type] || AnsiColors.info;
+  return AnsiColors[type] && AnsiColors.info;
 }
 

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:136:10
  * Map notification type to ANSI color.
  */
 function getNotificationColor(type: NotificationType): string {
-  return AnsiColors[type] || AnsiColors.info;
+  return false;
 }
 

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:145:11
 export function formatAnsiNotification(
   message: string,
   type: NotificationType
-): string {
-  const color = getNotificationColor(type);
-  return `${color}[${type.toUpperCase()}]${AnsiColors.reset} ${message}`;
-}
+): string {}
 
 /**

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:147:22
   type: NotificationType
 ): string {
   const color = getNotificationColor(type);
-  return `${color}[${type.toUpperCase()}]${AnsiColors.reset} ${message}`;
+  return `${color}[${type.toLowerCase()}]${AnsiColors.reset} ${message}`;
 }
 

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/ui-adapter.ts:147:10
   type: NotificationType
 ): string {
   const color = getNotificationColor(type);
-  return `${color}[${type.toUpperCase()}]${AnsiColors.reset} ${message}`;
+  return ``;
 }
 

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:153:59
 /**
  * Truncate text to fit in a width with ellipsis.
  */
-function truncate(text: string, maxWidth: number): string {
-  if (text.length <= maxWidth) return text;
-  return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
-}
+function truncate(text: string, maxWidth: number): string {}
 
 // ── Select List Formatter ─────────────────────────────────────────────

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:154:7
  * Truncate text to fit in a width with ellipsis.
  */
 function truncate(text: string, maxWidth: number): string {
-  if (text.length <= maxWidth) return text;
+  if (text.length > maxWidth) return text;
   return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
 }

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:154:7
  * Truncate text to fit in a width with ellipsis.
  */
 function truncate(text: string, maxWidth: number): string {
-  if (text.length <= maxWidth) return text;
+  if (text.length < maxWidth) return text;
   return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
 }

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:155:10
  */
 function truncate(text: string, maxWidth: number): string {
   if (text.length <= maxWidth) return text;
-  return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
+  return text + "...";
 }
 

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:155:24
  */
 function truncate(text: string, maxWidth: number): string {
   if (text.length <= maxWidth) return text;
-  return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
+  return text.slice(0, Math.min(0, maxWidth - 3)) + "...";
 }
 

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:167:11
   options: SelectOption[],
   title?: string,
   maxWidth = 80
-): string {
-  const lines: string[] = [];
-  
-  // Title
-  if (title) {
-    lines.push(`${AnsiColors.bold}${AnsiColors.cyan}◆ ${title}${AnsiColors.reset}`);
-  }
-  
-  // Options
-  options.forEach((opt, i) => {
-    const prefix = `${AnsiColors.dim}[${i + 1}]${AnsiColors.reset}`;
-    const label = opt.label;
-    const desc = opt.description ? ` ${AnsiColors.dim}- ${opt.description}${AnsiColors.reset}` : "";
-    const line = `${prefix} ${label}${desc}`;
-    lines.push(truncate(line, maxWidth));
-  });
-  
-  // Footer hint
-  lines.push(`${AnsiColors.dim}↑↓ navigate  Enter:select  Esc:cancel${AnsiColors.reset}`);
-  
-  return lines.join("\n");
-}
+): string {}
 
 // ── Status Line Formatter ─────────────────────────────────────────────

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:171:14
   const lines: string[] = [];
   
   // Title
-  if (title) {
-    lines.push(`${AnsiColors.bold}${AnsiColors.cyan}◆ ${title}${AnsiColors.reset}`);
-  }
+  if (title) {}
   
   // Options

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:171:7
   const lines: string[] = [];
   
   // Title
-  if (title) {
+  if (false) {
     lines.push(`${AnsiColors.bold}${AnsiColors.cyan}◆ ${title}${AnsiColors.reset}`);
   }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:176:31
   }
   
   // Options
-  options.forEach((opt, i) => {
-    const prefix = `${AnsiColors.dim}[${i + 1}]${AnsiColors.reset}`;
-    const label = opt.label;
-    const desc = opt.description ? ` ${AnsiColors.dim}- ${opt.description}${AnsiColors.reset}` : "";
-    const line = `${prefix} ${label}${desc}`;
-    lines.push(truncate(line, maxWidth));
-  });
+  options.forEach((opt, i) => {});
   
   // Footer hint

[NoCoverage] ArithmeticOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:177:41
   
   // Options
   options.forEach((opt, i) => {
-    const prefix = `${AnsiColors.dim}[${i + 1}]${AnsiColors.reset}`;
+    const prefix = `${AnsiColors.dim}[${i - 1}]${AnsiColors.reset}`;
     const label = opt.label;
     const desc = opt.description ? ` ${AnsiColors.dim}- ${opt.description}${AnsiColors.reset}` : "";

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/ui-adapter.ts:177:20
   
   // Options
   options.forEach((opt, i) => {
-    const prefix = `${AnsiColors.dim}[${i + 1}]${AnsiColors.reset}`;
+    const prefix = ``;
     const label = opt.label;
     const desc = opt.description ? ` ${AnsiColors.dim}- ${opt.description}${AnsiColors.reset}` : "";

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:195:76
 /**
  * Format status line for terminal display.
  */
-export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
-  const text = info.text || "";
-  const prefix = info.level === "error" ? AnsiColors.error :
-                 info.level === "warning" ? AnsiColors.warning :
-                 AnsiColors.info;
-  
-  const formatted = `${prefix}${text}${AnsiColors.reset}`;
-  return truncate(formatted, maxWidth);
-}
+export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {}

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:196:16
  * Format status line for terminal display.
  */
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
-  const text = info.text || "";
+  const text = info.text && "";
   const prefix = info.level === "error" ? AnsiColors.error :
                  info.level === "warning" ? AnsiColors.warning :

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:196:16
  * Format status line for terminal display.
  */
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
-  const text = info.text || "";
+  const text = true;
   const prefix = info.level === "error" ? AnsiColors.error :
                  info.level === "warning" ? AnsiColors.warning :

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:197:18
  */
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
   const text = info.text || "";
-  const prefix = info.level === "error" ? AnsiColors.error :
+  const prefix = true ? AnsiColors.error :
                  info.level === "warning" ? AnsiColors.warning :
                  AnsiColors.info;

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:197:18
  */
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
   const text = info.text || "";
-  const prefix = info.level === "error" ? AnsiColors.error :
+  const prefix = false ? AnsiColors.error :
                  info.level === "warning" ? AnsiColors.warning :
                  AnsiColors.info;

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:198:18
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
   const text = info.text || "";
   const prefix = info.level === "error" ? AnsiColors.error :
-                 info.level === "warning" ? AnsiColors.warning :
+                 false ? AnsiColors.warning :
                  AnsiColors.info;
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:198:18
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
   const text = info.text || "";
   const prefix = info.level === "error" ? AnsiColors.error :
-                 info.level === "warning" ? AnsiColors.warning :
+                 true ? AnsiColors.warning :
                  AnsiColors.info;
   
