[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-factory.ts:22:66
  * @param cli - CLI identifier (defaults to "generic")
  * @returns UIAdapter instance
  */
-export function createUIAdapter(cli: CLI = "generic"): UIAdapter {
-  switch (cli) {
-    case "pi":
-      return createPiUIAdapter();
-    case "opencode":
-      return createOpenCodeUIAdapter();
-    case "claude-code":
-      return createClaudeCodeUIAdapter();
-    case "codex":
-      return createCodexUIAdapter();
-    default:
-      // Return a generic no-op adapter
-      return createGenericUIAdapter();
-  }
-}
+export function createUIAdapter(cli: CLI = "generic"): UIAdapter {}
 
 // ── Generic UI Adapter (Fallback) ────────────────────────────────────

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-factory.ts:24:5
  */
 export function createUIAdapter(cli: CLI = "generic"): UIAdapter {
   switch (cli) {
-    case "pi":
-      return createPiUIAdapter();
+    case "pi":
     case "opencode":
       return createOpenCodeUIAdapter();

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-factory.ts:26:5
   switch (cli) {
     case "pi":
       return createPiUIAdapter();
-    case "opencode":
-      return createOpenCodeUIAdapter();
+    case "opencode":
     case "claude-code":
       return createClaudeCodeUIAdapter();

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-factory.ts:28:5
       return createPiUIAdapter();
     case "opencode":
       return createOpenCodeUIAdapter();
-    case "claude-code":
-      return createClaudeCodeUIAdapter();
+    case "claude-code":
     case "codex":
       return createCodexUIAdapter();

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-factory.ts:30:5
       return createOpenCodeUIAdapter();
     case "claude-code":
       return createClaudeCodeUIAdapter();
-    case "codex":
-      return createCodexUIAdapter();
+    case "codex":
     default:
       // Return a generic no-op adapter

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-factory.ts:32:5
       return createClaudeCodeUIAdapter();
     case "codex":
       return createCodexUIAdapter();
-    default:
-      // Return a generic no-op adapter
-      return createGenericUIAdapter();
+    default:
   }
 }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-factory.ts:47:48
 class GenericUIAdapter implements UIAdapter {
   readonly cliName: string = "generic";
   
-  notify(message: string, type = "info"): void {
-    console.log(`[${type.toUpperCase()}] ${message}`);
-  }
+  notify(message: string, type = "info"): void {}
   
   async select(options: SelectOption[], _title?: string): Promise<string | null> {

[NoCoverage] MethodExpression
extensions/cali-product-workflow/adapters/ui-factory.ts:48:21
   readonly cliName: string = "generic";
   
   notify(message: string, type = "info"): void {
-    console.log(`[${type.toUpperCase()}] ${message}`);
+    console.log(`[${type.toLowerCase()}] ${message}`);
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-factory.ts:51:82
     console.log(`[${type.toUpperCase()}] ${message}`);
   }
   
-  async select(options: SelectOption[], _title?: string): Promise<string | null> {
-    console.warn("[GenericUI] Select not supported, returning first option");
-    return options[0]?.value || null;
-  }
+  async select(options: SelectOption[], _title?: string): Promise<string | null> {}
   
   setStatus(_info: StatusInfo): void {

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/ui-factory.ts:53:12
   
   async select(options: SelectOption[], _title?: string): Promise<string | null> {
     console.warn("[GenericUI] Select not supported, returning first option");
-    return options[0]?.value || null;
+    return options[0]?.value && null;
   }
   

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-factory.ts:53:12
   
   async select(options: SelectOption[], _title?: string): Promise<string | null> {
     console.warn("[GenericUI] Select not supported, returning first option");
-    return options[0]?.value || null;
+    return false;
   }
   

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-factory.ts:64:64
     // No-op for generic
   }
   
-  getCapabilityLevel(): "native" | "ansi" | "plain" | "silent" {
-    return "plain";
-  }
+  getCapabilityLevel(): "native" | "ansi" | "plain" | "silent" {}
 }
 

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/ui-factory.ts:65:12
   }
   
   getCapabilityLevel(): "native" | "ansi" | "plain" | "silent" {
-    return "plain";
+    return "";
   }
 }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-factory.ts:72:46
 /**
  * Create a generic UI adapter (fallback).
  */
-function createGenericUIAdapter(): UIAdapter {
-  return new GenericUIAdapter();
-}
+function createGenericUIAdapter(): UIAdapter {}
 
 // Re-export UIAdapter interface
