[Killed] ArrowFunction
extensions/cali-product-workflow/modules/file-store.ts:32:58
 export class TextFileStore implements IFileStore<string> {
   constructor(
     private readonly basePath: string,
-    private readonly encoder: (data: string) => string = (s) => s,
+    private readonly encoder: (data: string) => string = () => undefined,
     private readonly decoder: (data: string) => string = (s) => s
   ) {}
killedBy: TextFileStore should write and read text content
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] ArrowFunction
extensions/cali-product-workflow/modules/file-store.ts:33:58
   constructor(
     private readonly basePath: string,
     private readonly encoder: (data: string) => string = (s) => s,
-    private readonly decoder: (data: string) => string = (s) => s
+    private readonly decoder: (data: string) => string = () => undefined
   ) {}
 
killedBy: TextFileStore should write and read text content
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[NoCoverage] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:36:18
     private readonly decoder: (data: string) => string = (s) => s
   ) {}
 
-  path(): string {
-    return this.basePath;
-  }
+  path(): string {}
 
   exists(): boolean {

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:40:21
     return this.basePath;
   }
 
-  exists(): boolean {
-    return existsSync(this.basePath);
-  }
+  exists(): boolean {}
 
   read(): string | null {
killedBy: TextFileStore should return null when file does not exist
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:44:25
     return existsSync(this.basePath);
   }
 
-  read(): string | null {
-    if (!this.exists()) return null;
-    try {
-      const raw = readFileSync(this.basePath, "utf-8");
-      return this.decoder(raw);
-    } catch {
-      return null;
-    }
-  }
+  read(): string | null {}
 
   write(data: string): void {
killedBy: TextFileStore should return null when file does not exist
statusReason: expected undefined to be null

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/file-store.ts:45:9
   }
 
   read(): string | null {
-    if (!this.exists()) return null;
+    if (this.exists()) return null;
     try {
       const raw = readFileSync(this.basePath, "utf-8");
killedBy: TextFileStore should write and read text content
statusReason: expected null to be 'Hello, World!' // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:45:9
   }
 
   read(): string | null {
-    if (!this.exists()) return null;
+    if (true) return null;
     try {
       const raw = readFileSync(this.basePath, "utf-8");
killedBy: TextFileStore should write and read text content
statusReason: expected null to be 'Hello, World!' // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:46:9
 
   read(): string | null {
     if (!this.exists()) return null;
-    try {
-      const raw = readFileSync(this.basePath, "utf-8");
-      return this.decoder(raw);
-    } catch {
+    try {} catch {
       return null;
     }
killedBy: TextFileStore should write and read text content
statusReason: expected undefined to be 'Hello, World!' // Object.is equality

[NoCoverage] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:49:13
     try {
       const raw = readFileSync(this.basePath, "utf-8");
       return this.decoder(raw);
-    } catch {
-      return null;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:54:29
     }
   }
 
-  write(data: string): void {
-    const dir = dirname(this.basePath);
-    if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
-    }
-    writeFileSync(this.basePath, this.encoder(data), "utf-8");
-  }
+  write(data: string): void {}
 
   delete(): void {
killedBy: TextFileStore should write and read text content
statusReason: expected null to be 'Hello, World!' // Object.is equality

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/file-store.ts:56:9
 
   write(data: string): void {
     const dir = dirname(this.basePath);
-    if (!existsSync(dir)) {
+    if (existsSync(dir)) {
       mkdirSync(dir, { recursive: true });
     }
killedBy: TextFileStore should create parent directories automatically
statusReason: ENOENT: no such file or directory, open '/var/folders/v1/mxd3ndgj78sbz_ynpw8qts6m0000gn/T/pw-text-oxmRXQ/subdir/nested/test.txt'

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:56:9
 
   write(data: string): void {
     const dir = dirname(this.basePath);
-    if (!existsSync(dir)) {
+    if (false) {
       mkdirSync(dir, { recursive: true });
     }
killedBy: TextFileStore should create parent directories automatically
statusReason: ENOENT: no such file or directory, open '/var/folders/v1/mxd3ndgj78sbz_ynpw8qts6m0000gn/T/pw-text-l2yw2O/subdir/nested/test.txt'

[Survived] StringLiteral
extensions/cali-product-workflow/modules/file-store.ts:59:54
     if (!existsSync(dir)) {
       mkdirSync(dir, { recursive: true });
     }
-    writeFileSync(this.basePath, this.encoder(data), "utf-8");
+    writeFileSync(this.basePath, this.encoder(data), "");
   }
 

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:85:20
     return existsSync(this.basePath);
   }
 
-  read(): T | null {
-    if (!this.exists()) return null;
-    try {
-      const content = readFileSync(this.basePath, "utf-8");
-      return JSON.parse(content, this.reviver) as T;
-    } catch {
-      return null;
-    }
-  }
+  read(): T | null {}
 
   write(data: T): void {
killedBy: JsonFileStore should return null when file does not exist
statusReason: expected undefined to be null

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/file-store.ts:86:9
   }
 
   read(): T | null {
-    if (!this.exists()) return null;
+    if (this.exists()) return null;
     try {
       const content = readFileSync(this.basePath, "utf-8");
killedBy: JsonFileStore should write and read JSON objects
statusReason: expected null to deeply equal { name: 'test', value: 42 }

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:86:9
   }
 
   read(): T | null {
-    if (!this.exists()) return null;
+    if (true) return null;
     try {
       const content = readFileSync(this.basePath, "utf-8");
killedBy: JsonFileStore should write and read JSON objects
statusReason: expected null to deeply equal { name: 'test', value: 42 }

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:87:9
 
   read(): T | null {
     if (!this.exists()) return null;
-    try {
-      const content = readFileSync(this.basePath, "utf-8");
-      return JSON.parse(content, this.reviver) as T;
-    } catch {
+    try {} catch {
       return null;
     }
killedBy: JsonFileStore should write and read JSON objects
statusReason: expected undefined to deeply equal { name: 'test', value: 42 }

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:90:13
     try {
       const content = readFileSync(this.basePath, "utf-8");
       return JSON.parse(content, this.reviver) as T;
-    } catch {
-      return null;
-    }
+    } catch {}
   }
 
killedBy: JsonFileStore should return null for invalid JSON
statusReason: expected undefined to be null

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:95:24
     }
   }
 
-  write(data: T): void {
-    const dir = dirname(this.basePath);
-    if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
-    }
-    writeFileSync(this.basePath, JSON.stringify(data, this.replacer, 2), "utf-8");
-  }
+  write(data: T): void {}
 
   delete(): void {
killedBy: JsonFileStore should write and read JSON objects
statusReason: expected null to deeply equal { name: 'test', value: 42 }

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:97:27
 
   write(data: T): void {
     const dir = dirname(this.basePath);
-    if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
-    }
+    if (!existsSync(dir)) {}
     writeFileSync(this.basePath, JSON.stringify(data, this.replacer, 2), "utf-8");
   }
killedBy: JsonFileStore should create parent directories automatically
statusReason: ENOENT: no such file or directory, open '/var/folders/v1/mxd3ndgj78sbz_ynpw8qts6m0000gn/T/pw-json-OTqVsb/subdir/nested/test.json'

[Killed] ObjectLiteral
extensions/cali-product-workflow/modules/file-store.ts:98:22
   write(data: T): void {
     const dir = dirname(this.basePath);
     if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
+      mkdirSync(dir, {});
     }
     writeFileSync(this.basePath, JSON.stringify(data, this.replacer, 2), "utf-8");
killedBy: JsonFileStore should create parent directories automatically
statusReason: ENOENT: no such file or directory, mkdir '/var/folders/v1/mxd3ndgj78sbz_ynpw8qts6m0000gn/T/pw-json-1ZTGEj/subdir/nested'

[Survived] StringLiteral
extensions/cali-product-workflow/modules/file-store.ts:100:74
     if (!existsSync(dir)) {
       mkdirSync(dir, { recursive: true });
     }
-    writeFileSync(this.basePath, JSON.stringify(data, this.replacer, 2), "utf-8");
+    writeFileSync(this.basePath, JSON.stringify(data, this.replacer, 2), "");
   }
 

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:129:20
    * Read items from markdown file.
    * Skips header line and empty lines.
    */
-  read(): string[] {
-    if (!this.exists()) return [];
-    try {
-      const content = readFileSync(this.basePath, "utf-8");
-      return content
-        .split("\n")
-        .map(line => line.trim())
-        .filter(line => line.length > 0)
-        .filter(line => !line.startsWith("#"));
-    } catch {
-      return [];
-    }
-  }
+  read(): string[] {}
 
   /**
killedBy: MarkdownFileStore should return empty array when file does not exist
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:130:9
    * Skips header line and empty lines.
    */
   read(): string[] {
-    if (!this.exists()) return [];
+    if (true) return [];
     try {
       const content = readFileSync(this.basePath, "utf-8");
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/file-store.ts:130:9
    * Skips header line and empty lines.
    */
   read(): string[] {
-    if (!this.exists()) return [];
+    if (this.exists()) return [];
     try {
       const content = readFileSync(this.basePath, "utf-8");
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:131:9
    */
   read(): string[] {
     if (!this.exists()) return [];
-    try {
-      const content = readFileSync(this.basePath, "utf-8");
-      return content
-        .split("\n")
-        .map(line => line.trim())
-        .filter(line => line.length > 0)
-        .filter(line => !line.startsWith("#"));
-    } catch {
+    try {} catch {
       return [];
     }
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected undefined to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] StringLiteral
extensions/cali-product-workflow/modules/file-store.ts:132:51
   read(): string[] {
     if (!this.exists()) return [];
     try {
-      const content = readFileSync(this.basePath, "utf-8");
+      const content = readFileSync(this.basePath, "");
       return content
         .split("\n")
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] MethodExpression
extensions/cali-product-workflow/modules/file-store.ts:133:14
     if (!this.exists()) return [];
     try {
       const content = readFileSync(this.basePath, "utf-8");
-      return content
-        .split("\n")
-        .map(line => line.trim())
-        .filter(line => line.length > 0)
-        .filter(line => !line.startsWith("#"));
+      return content.split("\n").map(line => line.trim()).filter(line => line.length > 0);
     } catch {
       return [];
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [ Array(4) ] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] MethodExpression
extensions/cali-product-workflow/modules/file-store.ts:133:14
     if (!this.exists()) return [];
     try {
       const content = readFileSync(this.basePath, "utf-8");
-      return content
-        .split("\n")
-        .map(line => line.trim())
-        .filter(line => line.length > 0)
+      return content.split("\n").map(line => line.trim())
         .filter(line => !line.startsWith("#"));
     } catch {
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [ '', 'item1', 'item2', 'item3', '' ] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] MethodExpression
extensions/cali-product-workflow/modules/file-store.ts:135:22
       const content = readFileSync(this.basePath, "utf-8");
       return content
         .split("\n")
-        .map(line => line.trim())
+        .map(line => line)
         .filter(line => line.length > 0)
         .filter(line => !line.startsWith("#"));
killedBy: MarkdownFileStore should skip empty lines when reading
statusReason: expected [ 'item1', 'item2', '   ', 'item3' ] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] ArrowFunction
extensions/cali-product-workflow/modules/file-store.ts:135:14
       const content = readFileSync(this.basePath, "utf-8");
       return content
         .split("\n")
-        .map(line => line.trim())
+        .map(() => undefined)
         .filter(line => line.length > 0)
         .filter(line => !line.startsWith("#"));
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:136:25
       return content
         .split("\n")
         .map(line => line.trim())
-        .filter(line => line.length > 0)
+        .filter(line => true)
         .filter(line => !line.startsWith("#"));
     } catch {
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [ '', 'item1', 'item2', 'item3', '' ] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:136:25
       return content
         .split("\n")
         .map(line => line.trim())
-        .filter(line => line.length > 0)
+        .filter(line => false)
         .filter(line => !line.startsWith("#"));
     } catch {
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] MethodExpression
extensions/cali-product-workflow/modules/file-store.ts:137:26
         .split("\n")
         .map(line => line.trim())
         .filter(line => line.length > 0)
-        .filter(line => !line.startsWith("#"));
+        .filter(line => !line.endsWith("#"));
     } catch {
       return [];
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [ Array(4) ] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/file-store.ts:137:25
         .split("\n")
         .map(line => line.trim())
         .filter(line => line.length > 0)
-        .filter(line => !line.startsWith("#"));
+        .filter(line => line.startsWith("#"));
     } catch {
       return [];
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [ '# Items' ] to deeply equal [ 'item1', 'item2', 'item3' ]

[NoCoverage] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:138:13
         .map(line => line.trim())
         .filter(line => line.length > 0)
         .filter(line => !line.startsWith("#"));
-    } catch {
-      return [];
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:146:32
   /**
    * Write items to markdown file with header.
    */
-  write(items: string[]): void {
-    const dir = dirname(this.basePath);
-    if (!existsSync(dir)) {
-      mkdirSync(dir, { recursive: true });
-    }
-    const header = `${this.headerLine}\n\n`;
-    const content = items.length > 0 ? items.join("\n") + "\n" : "\n";
-    writeFileSync(this.basePath, header + content, "utf-8");
-  }
+  write(items: string[]): void {}
 
   delete(): void {
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] StringLiteral
extensions/cali-product-workflow/modules/file-store.ts:151:20
     if (!existsSync(dir)) {
       mkdirSync(dir, { recursive: true });
     }
-    const header = `${this.headerLine}\n\n`;
+    const header = ``;
     const content = items.length > 0 ? items.join("\n") + "\n" : "\n";
     writeFileSync(this.basePath, header + content, "utf-8");
killedBy: MarkdownFileStore should write with custom header
statusReason: expected 'item1\nitem2\n' to contain '# Custom Header'

[Killed] EqualityOperator
extensions/cali-product-workflow/modules/file-store.ts:152:21
       mkdirSync(dir, { recursive: true });
     }
     const header = `${this.headerLine}\n\n`;
-    const content = items.length > 0 ? items.join("\n") + "\n" : "\n";
+    const content = items.length <= 0 ? items.join("\n") + "\n" : "\n";
     writeFileSync(this.basePath, header + content, "utf-8");
   }
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:152:21
       mkdirSync(dir, { recursive: true });
     }
     const header = `${this.headerLine}\n\n`;
-    const content = items.length > 0 ? items.join("\n") + "\n" : "\n";
+    const content = false ? items.join("\n") + "\n" : "\n";
     writeFileSync(this.basePath, header + content, "utf-8");
   }
killedBy: MarkdownFileStore should write with default header and read items
statusReason: expected [] to deeply equal [ 'item1', 'item2', 'item3' ]

[Killed] ArithmeticOperator
extensions/cali-product-workflow/modules/file-store.ts:153:34
     }
     const header = `${this.headerLine}\n\n`;
     const content = items.length > 0 ? items.join("\n") + "\n" : "\n";
-    writeFileSync(this.basePath, header + content, "utf-8");
+    writeFileSync(this.basePath, header - content, "utf-8");
   }
 
killedBy: MarkdownFileStore should write with default header and read items
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received type number (NaN)

[Killed] BlockStatement
extensions/cali-product-workflow/modules/file-store.ts:164:47
 /**
  * Ensure directory exists.
  */
-export function ensureDir(path: string): void {
-  if (!existsSync(path)) {
-    mkdirSync(path, { recursive: true });
-  }
-}
+export function ensureDir(path: string): void {}
killedBy: ensureDir should create nested directories
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/file-store.ts:165:7
  * Ensure directory exists.
  */
 export function ensureDir(path: string): void {
-  if (!existsSync(path)) {
+  if (false) {
     mkdirSync(path, { recursive: true });
   }
killedBy: ensureDir should create nested directories
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/file-store.ts:165:7
  * Ensure directory exists.
  */
 export function ensureDir(path: string): void {
-  if (!existsSync(path)) {
+  if (existsSync(path)) {
     mkdirSync(path, { recursive: true });
   }
killedBy: ensureDir should create nested directories
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/file-store.ts:166:34
  */
 export function ensureDir(path: string): void {
   if (!existsSync(path)) {
-    mkdirSync(path, { recursive: true });
+    mkdirSync(path, { recursive: false });
   }
 }
killedBy: ensureDir should create nested directories
statusReason: ENOENT: no such file or directory, mkdir '/var/folders/v1/mxd3ndgj78sbz_ynpw8qts6m0000gn/T/pw-ensure-dkZP5B/a/b/c/d'
