[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:37:78
    * @param loadFromFile - Optional function to load data from file
    * @param saveToFile - Optional function to save data to file
    */
-  constructor(loadFromFile?: () => T | null, saveToFile?: (data: T) => void) {
-    this._loadFromFile = loadFromFile;
-    this._saveToFile = saveToFile;
-  }
+  constructor(loadFromFile?: () => T | null, saveToFile?: (data: T) => void) {}
 
   /**
killedBy: CacheManager with file sync should load from file when memory is empty
statusReason: expected null to be 'from-file' // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:45:19
   /**
    * Get data from cache or file.
    */
-  get(): T | null {
-    if (this._data !== null) return this._data;
-    if (this._loadFromFile) {
-      this._data = this._loadFromFile();
-    }
-    return this._data;
-  }
+  get(): T | null {}
 
   /**
killedBy: CacheManager without file sync should start empty
statusReason: expected undefined to be null

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:46:9
    * Get data from cache or file.
    */
   get(): T | null {
-    if (this._data !== null) return this._data;
+    if (true) return this._data;
     if (this._loadFromFile) {
       this._data = this._loadFromFile();
killedBy: CacheManager with file sync should load from file when memory is empty
statusReason: expected null to be 'from-file' // Object.is equality

[Killed] EqualityOperator
extensions/cali-product-workflow/modules/cache.ts:46:9
    * Get data from cache or file.
    */
   get(): T | null {
-    if (this._data !== null) return this._data;
+    if (this._data === null) return this._data;
     if (this._loadFromFile) {
       this._data = this._loadFromFile();
killedBy: CacheManager with file sync should load from file when memory is empty
statusReason: expected null to be 'from-file' // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:47:9
    */
   get(): T | null {
     if (this._data !== null) return this._data;
-    if (this._loadFromFile) {
+    if (true) {
       this._data = this._loadFromFile();
     }
killedBy: CacheManager without file sync should start empty
statusReason: this._loadFromFile is not a function

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:47:29
    */
   get(): T | null {
     if (this._data !== null) return this._data;
-    if (this._loadFromFile) {
-      this._data = this._loadFromFile();
-    }
+    if (this._loadFromFile) {}
     return this._data;
   }
killedBy: CacheManager with file sync should load from file when memory is empty
statusReason: expected null to be 'from-file' // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:56:22
   /**
    * Set data in cache and optionally persist to file.
    */
-  set(data: T): void {
-    this._data = data;
-    if (this._saveToFile) {
-      this._saveToFile(data);
-    }
-  }
+  set(data: T): void {}
 
   /**
killedBy: CacheManager without file sync should store and retrieve data
statusReason: expected null to be 'hello' // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:58:27
    */
   set(data: T): void {
     this._data = data;
-    if (this._saveToFile) {
-      this._saveToFile(data);
-    }
+    if (this._saveToFile) {}
   }
 
killedBy: CacheManager with file sync should call saver on set
statusReason: expected "vi.fn()" to be called with arguments: [ 'data' ]

Number of calls: 0

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:58:9
    */
   set(data: T): void {
     this._data = data;
-    if (this._saveToFile) {
+    if (false) {
       this._saveToFile(data);
     }
killedBy: CacheManager with file sync should call saver on set
statusReason: expected "vi.fn()" to be called with arguments: [ 'data' ]

Number of calls: 0

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:66:17
   /**
    * Clear cache and optionally file.
    */
-  clear(): void {
-    this._data = null;
-    // Note: File clearing is optional and should be done explicitly
-  }
+  clear(): void {}
 
   /**
killedBy: CacheManager without file sync should clear data
statusReason: expected 'data' to be null

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:74:22
   /**
    * Check if cache is empty.
    */
-  isEmpty(): boolean {
-    return this._data === null;
-  }
+  isEmpty(): boolean {}
 
   /**
killedBy: CacheManager without file sync should start empty
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:75:12
    * Check if cache is empty.
    */
   isEmpty(): boolean {
-    return this._data === null;
+    return true;
   }
 
killedBy: CacheManager without file sync should store and retrieve data
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:75:12
    * Check if cache is empty.
    */
   isEmpty(): boolean {
-    return this._data === null;
+    return false;
   }
 
killedBy: CacheManager without file sync should start empty
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:81:22
   /**
    * Check if cache has data (including from file).
    */
-  hasData(): boolean {
-    if (this._data !== null) return true;
-    if (this._loadFromFile) {
-      const fromFile = this._loadFromFile();
-      return fromFile !== null;
-    }
-    return false;
-  }
+  hasData(): boolean {}
 }
 
killedBy: CacheManager without file sync should start empty
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:82:9
    * Check if cache has data (including from file).
    */
   hasData(): boolean {
-    if (this._data !== null) return true;
+    if (false) return true;
     if (this._loadFromFile) {
       const fromFile = this._loadFromFile();
killedBy: CacheManager without file sync should store and retrieve data
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
extensions/cali-product-workflow/modules/cache.ts:82:37
    * Check if cache has data (including from file).
    */
   hasData(): boolean {
-    if (this._data !== null) return true;
+    if (this._data !== null) return false;
     if (this._loadFromFile) {
       const fromFile = this._loadFromFile();
killedBy: CacheManager without file sync should store and retrieve data
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:83:9
    */
   hasData(): boolean {
     if (this._data !== null) return true;
-    if (this._loadFromFile) {
+    if (false) {
       const fromFile = this._loadFromFile();
       return fromFile !== null;
killedBy: CacheManager with file sync should report hasData=true when file has data
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:83:29
    */
   hasData(): boolean {
     if (this._data !== null) return true;
-    if (this._loadFromFile) {
-      const fromFile = this._loadFromFile();
-      return fromFile !== null;
-    }
+    if (this._loadFromFile) {}
     return false;
   }
killedBy: CacheManager with file sync should report hasData=true when file has data
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:85:14
     if (this._data !== null) return true;
     if (this._loadFromFile) {
       const fromFile = this._loadFromFile();
-      return fromFile !== null;
+      return true;
     }
     return false;
killedBy: CacheManager with file sync should report hasData=false when file returns null
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/cache.ts:85:14
     if (this._data !== null) return true;
     if (this._loadFromFile) {
       const fromFile = this._loadFromFile();
-      return fromFile !== null;
+      return false;
     }
     return false;
killedBy: CacheManager with file sync should report hasData=true when file has data
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:97:30
 export class MapCache<K, V> {
   private readonly _map: Map<K, V> = new Map();
 
-  get(key: K): V | undefined {
-    return this._map.get(key);
-  }
+  get(key: K): V | undefined {}
 
   set(key: K, value: V): void {
killedBy: MapCache should store and retrieve values
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:101:31
     return this._map.get(key);
   }
 
-  set(key: K, value: V): void {
-    this._map.set(key, value);
-  }
+  set(key: K, value: V): void {}
 
   has(key: K): boolean {
killedBy: MapCache should store and retrieve values
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:105:24
     this._map.set(key, value);
   }
 
-  has(key: K): boolean {
-    return this._map.has(key);
-  }
+  has(key: K): boolean {}
 
   delete(key: K): boolean {
killedBy: MapCache should report has correctly
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:109:27
     return this._map.has(key);
   }
 
-  delete(key: K): boolean {
-    return this._map.delete(key);
-  }
+  delete(key: K): boolean {}
 
   clear(): void {
killedBy: MapCache should delete entries
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:113:17
     return this._map.delete(key);
   }
 
-  clear(): void {
-    this._map.clear();
-  }
+  clear(): void {}
 
   keys(): IterableIterator<K> {
killedBy: MapCache should clear all entries
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:117:31
     this._map.clear();
   }
 
-  keys(): IterableIterator<K> {
-    return this._map.keys();
-  }
+  keys(): IterableIterator<K> {}
 
   values(): IterableIterator<V> {
killedBy: MapCache should iterate keys
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:121:33
     return this._map.keys();
   }
 
-  values(): IterableIterator<V> {
-    return this._map.values();
-  }
+  values(): IterableIterator<V> {}
 
   entries(): IterableIterator<[K, V]> {
killedBy: MapCache should iterate values
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:125:39
     return this._map.values();
   }
 
-  entries(): IterableIterator<[K, V]> {
-    return this._map.entries();
-  }
+  entries(): IterableIterator<[K, V]> {}
 
   size(): number {
killedBy: MapCache should iterate entries
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
extensions/cali-product-workflow/modules/cache.ts:129:18
     return this._map.entries();
   }
 
-  size(): number {
-    return this._map.size;
-  }
+  size(): number {}
 }
killedBy: MapCache should clear all entries
statusReason: expected undefined to be +0 // Object.is equality
