[Killed] ObjectLiteral
extensions/cali-product-workflow/modules/task.ts:65:55
 /**
  * Status icons for display.
  */
-export const TASK_ICONS: Record<TaskStatus, string> = {
-  pending: "○",
-  in_progress: "◐",
-  completed: "✓",
-};
+export const TASK_ICONS: Record<TaskStatus, string> = {};
 
 /**
killedBy: TaskStatus should match TASK_ICONS keys
statusReason: expected [] to deeply equal [ 'pending', 'in_progress', …(1) ]

[Killed] BlockStatement
extensions/cali-product-workflow/modules/task.ts:74:52
 /**
  * Format a task for display.
  */
-export function formatTask(task: TaskItem): string {
-  const icon = TASK_ICONS[task.status];
-  const id = task.id ? `[${task.id}] ` : "";
-  return `${icon} ${id}${task.content}`;
-}
+export function formatTask(task: TaskItem): string {}
 
 /**
killedBy: formatTask should format task without id
statusReason: expected undefined to be '○ Simple task' // Object.is equality

[Killed] StringLiteral
extensions/cali-product-workflow/modules/task.ts:76:24
  */
 export function formatTask(task: TaskItem): string {
   const icon = TASK_ICONS[task.status];
-  const id = task.id ? `[${task.id}] ` : "";
+  const id = task.id ? `` : "";
   return `${icon} ${id}${task.content}`;
 }
killedBy: formatTask should format task with id
statusReason: expected '◐ Define the hill' to be '◐ [SHAPE-1] Define the hill' // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/task.ts:83:76
 /**
  * Format a list of tasks for display.
  */
-export function formatTaskList(tasks: TaskItem[], header?: string): string {
-  const lines: string[] = [];
-  if (header) {
-    lines.push(header, "");
-  }
-  for (const task of tasks) {
-    lines.push(formatTask(task));
-  }
-  return lines.join("\n");
-}
+export function formatTaskList(tasks: TaskItem[], header?: string): string {}
killedBy: formatTaskList should format empty list
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/task.ts:85:7
  */
 export function formatTaskList(tasks: TaskItem[], header?: string): string {
   const lines: string[] = [];
-  if (header) {
+  if (true) {
     lines.push(header, "");
   }
killedBy: formatTaskList should format empty list
statusReason: expected '\n' to be '' // Object.is equality

[Killed] ConditionalExpression
extensions/cali-product-workflow/modules/task.ts:85:7
  */
 export function formatTaskList(tasks: TaskItem[], header?: string): string {
   const lines: string[] = [];
-  if (header) {
+  if (false) {
     lines.push(header, "");
   }
killedBy: formatTaskList should format list with header
statusReason: expected '○ [1] Task 1' to be 'SHAPE Phase Tasks:\n\n○ [1] Task 1' // Object.is equality

[Killed] BlockStatement
extensions/cali-product-workflow/modules/task.ts:88:29
   if (header) {
     lines.push(header, "");
   }
-  for (const task of tasks) {
-    lines.push(formatTask(task));
-  }
+  for (const task of tasks) {}
   return lines.join("\n");
 }
killedBy: formatTaskList should format list without header
statusReason: expected '' to be '○ [1] Task 1\n✓ [2] Task 2' // Object.is equality
