[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:176:40
 /**
  * Create the Pi adapter.
  */
-function createPiAdapter(): CLIAdapter {
-  // Lazy import to avoid circular dependencies
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createPiAdapter: makePiAdapter } = require("./pi/index.js");
-  return makePiAdapter();
-}
+function createPiAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:186:46
 /**
  * Create the OpenCode adapter.
  */
-function createOpenCodeAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createOpenCodeAdapter: makeOpenCodeAdapter } = require("./opencode/index.js");
-  return makeOpenCodeAdapter();
-}
+function createOpenCodeAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:195:48
 /**
  * Create the Claude Code adapter.
  */
-function createClaudeCodeAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createClaudeCodeAdapter: makeClaudeCodeAdapter } = require("./claude-code/index.js");
-  return makeClaudeCodeAdapter();
-}
+function createClaudeCodeAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:204:43
 /**
  * Create the Codex adapter.
  */
-function createCodexAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createCodexAdapter: makeCodexAdapter } = require("./codex/index.js");
-  return makeCodexAdapter();
-}
+function createCodexAdapter(): CLIAdapter {}
 
 /**

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/cli-adapter.ts:214:43
  * Create a generic adapter with no-op implementations.
  * Used as fallback when no specific CLI is detected.
  */
-function makeGenericAdapter(): CLIAdapter {
-  // eslint-disable-next-line @typescript-eslint/no-var-requires
-  const { createGenericAdapter } = require("./generic.js");
-  return createGenericAdapter();
-}
+function makeGenericAdapter(): CLIAdapter {}
 
 /**
