[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:27:11
  */
 export const WORKFLOW_COMMANDS: CommandDescriptor[] = [
   {
-    name: "pw:start",
+    name: "",
     canonicalName: "product-workflow-start",
     description: "Start a new product workflow",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:36:12
     name: "pw:stop",
     canonicalName: "product-workflow-stop",
     description: "Stop workflow(s)",
-    usage: "/pw:stop | all | name1 name2",
+    usage: "",
   },
   {

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:40:20
   },
   {
     name: "pw:pause",
-    canonicalName: "product-workflow-pause",
+    canonicalName: "",
     description: "Pause active workflow",
     usage: "/pw:pause",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:41:18
   {
     name: "pw:pause",
     canonicalName: "product-workflow-pause",
-    description: "Pause active workflow",
+    description: "",
     usage: "/pw:pause",
   },

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:44:3
     description: "Pause active workflow",
     usage: "/pw:pause",
   },
-  {
-    name: "pw:resume",
-    canonicalName: "product-workflow-resume",
-    description: "Resume paused workflow",
-    usage: "/pw:resume [name=name]",
-  },
+  {},
   {
     name: "pw:status",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:48:12
     name: "pw:resume",
     canonicalName: "product-workflow-resume",
     description: "Resume paused workflow",
-    usage: "/pw:resume [name=name]",
+    usage: "",
   },
   {

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:52:20
   },
   {
     name: "pw:status",
-    canonicalName: "product-workflow-status",
+    canonicalName: "",
     description: "Show active workflow status",
     usage: "/pw:status",

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:56:3
     description: "Show active workflow status",
     usage: "/pw:status",
   },
-  {
-    name: "pw:ls",
-    canonicalName: "product-workflow-list",
-    description: "List workflows",
-    usage: "/pw:ls | all | archived | path=DIR",
-  },
+  {},
   {
     name: "pw:setphase",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:57:11
     usage: "/pw:status",
   },
   {
-    name: "pw:ls",
+    name: "",
     canonicalName: "product-workflow-list",
     description: "List workflows",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:58:20
   },
   {
     name: "pw:ls",
-    canonicalName: "product-workflow-list",
+    canonicalName: "",
     description: "List workflows",
     usage: "/pw:ls | all | archived | path=DIR",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:60:12
     name: "pw:ls",
     canonicalName: "product-workflow-list",
     description: "List workflows",
-    usage: "/pw:ls | all | archived | path=DIR",
+    usage: "",
   },
   {

[NoCoverage] ObjectLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:68:3
     description: "Jump to phase",
     usage: "/pw:setphase phase=N | phasename=Name",
   },
-  {
-    name: "pw:next",
-    canonicalName: "product-workflow-next",
-    description: "Advance to next phase",
-    usage: "/pw:next",
-  },
+  {},
   {
     name: "pw:complete",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:71:18
   {
     name: "pw:next",
     canonicalName: "product-workflow-next",
-    description: "Advance to next phase",
+    description: "",
     usage: "/pw:next",
   },

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:81:11
     usage: "/pw:complete",
   },
   {
-    name: "pw:goto",
+    name: "",
     canonicalName: "product-workflow-goto",
     description: "Go to a workflow",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:88:20
   },
   {
     name: "pw:rename",
-    canonicalName: "product-workflow-rename",
+    canonicalName: "",
     description: "Rename active workflow",
     usage: "/pw:rename novo-nome | name=novo-nome",

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:90:12
     name: "pw:rename",
     canonicalName: "product-workflow-rename",
     description: "Rename active workflow",
-    usage: "/pw:rename novo-nome | name=novo-nome",
+    usage: "",
   },
   {

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:99:11
     usage: "/pw:menu",
   },
   {
-    name: "pw:clean",
+    name: "",
     canonicalName: "product-workflow-clean",
     description: "Archive stale or purge archived",

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:109:57
 /**
  * Get commands that are aliases.
  */
-export function getAliasCommands(): CommandDescriptor[] {
-  return WORKFLOW_COMMANDS;
-}
+export function getAliasCommands(): CommandDescriptor[] {}
 
 /**

[NoCoverage] ConditionalExpression
cali-product-workflow/adapters/commands/dispatcher.ts:152:20
  * Get the appropriate command registration system for the current CLI.
  */
 export function getCommandSystem(cli?: CLI): CommandRegistrationSystem {
-  const detected = cli || detectCLI();
+  const detected = true;
   
   switch (detected) {

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:155:10
   const detected = cli || detectCLI();
   
   switch (detected) {
-    case "pi":
+    case "":
       return getPiCommandSystem();
     case "opencode":

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:224:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name.replace(":", "-")}.md`,
-        content: generateOpenCodeSkillFile(cmd),
-      }));
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrowFunction
cali-product-workflow/adapters/commands/dispatcher.ts:225:36
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name.replace(":", "-")}.md`,
-        content: generateOpenCodeSkillFile(cmd),
-      }));
+      return WORKFLOW_COMMANDS.map(() => undefined);
     },
   };

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:233:68
   };
 }
 
-function generateOpenCodeSkillFile(cmd: CommandDescriptor): string {
-  return `---
-name: ${cmd.name}
-description: ${cmd.description}
----
-
-${cmd.usage ? `// Usage: ${cmd.usage}` : ""}
-
-/skill:cali-product-workflow
-
-// Command: ${cmd.name}
-// This skill delegates to the product-workflow skill
-${cmd.name} {args}
-`;
-}
+function generateOpenCodeSkillFile(cmd: CommandDescriptor): string {}
 
 // ── Claude Code Command System ────────────────────────────────────────

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:271:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name.replace(":", "-")}.md`,
-        content: generateClaudeCodeSkillFile(cmd),
-      }));
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrowFunction
cali-product-workflow/adapters/commands/dispatcher.ts:272:36
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name.replace(":", "-")}.md`,
-        content: generateClaudeCodeSkillFile(cmd),
-      }));
+      return WORKFLOW_COMMANDS.map(() => undefined);
     },
   };

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:273:47
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
       return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name.replace(":", "-")}.md`,
+        path: `skills/${cmd.name.replace(":", "")}.md`,
         content: generateClaudeCodeSkillFile(cmd),
       }));

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:273:42
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
       return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `skills/${cmd.name.replace(":", "-")}.md`,
+        path: `skills/${cmd.name.replace("", "-")}.md`,
         content: generateClaudeCodeSkillFile(cmd),
       }));

[NoCoverage] BlockStatement
cali-product-workflow/adapters/commands/dispatcher.ts:313:70
       return "/";
     },
     
-    generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `commands/${cmd.name.replace(":", "-")}.md`,
-        content: generateCodexCommandFile(cmd),
-      }));
-    },
+    generateCommandFiles(): Array<{ path: string; content: string }> {},
   };
 }

[NoCoverage] ArrowFunction
cali-product-workflow/adapters/commands/dispatcher.ts:314:36
     },
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
-      return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `commands/${cmd.name.replace(":", "-")}.md`,
-        content: generateCodexCommandFile(cmd),
-      }));
+      return WORKFLOW_COMMANDS.map(() => undefined);
     },
   };

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:315:44
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
       return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `commands/${cmd.name.replace(":", "-")}.md`,
+        path: `commands/${cmd.name.replace("", "-")}.md`,
         content: generateCodexCommandFile(cmd),
       }));

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:315:15
     
     generateCommandFiles(): Array<{ path: string; content: string }> {
       return WORKFLOW_COMMANDS.map(cmd => ({
-        path: `commands/${cmd.name.replace(":", "-")}.md`,
+        path: ``,
         content: generateCodexCommandFile(cmd),
       }));

[NoCoverage] StringLiteral
cali-product-workflow/adapters/commands/dispatcher.ts:384:43
       mkdirSync(dir, { recursive: true });
     }
     
-    writeFileSync(fullPath, file.content, "utf8");
+    writeFileSync(fullPath, file.content, "");
     console.log(`[cali-product-workflow] Installed: ${file.path}`);
   }
