[Survived] StringLiteral
extensions/cali-product-workflow/adapters/generic.ts:30:17
   }
   
   initialize(): void {
-    console.log("[cali-product-workflow] Initialized generic adapter (limited functionality)");
+    console.log("");
     super.initialize();
   }

[Survived] StringLiteral
extensions/cali-product-workflow/adapters/generic.ts:45:36
     return [
       { name: "read", description: "Read file contents" },
       { name: "write", description: "Write content to file" },
-      { name: "bash", description: "Execute shell commands" },
+      { name: "bash", description: "" },
       { name: "edit", description: "Edit existing files" },
     ];

[Survived] StringLiteral
extensions/cali-product-workflow/adapters/generic.ts:51:17
   }
   
   showNotification(message: string, type: "info" | "warning" | "error" | "success" = "info"): void {
-    console.log(`[${type.toUpperCase()}] ${message}`);
+    console.log(``);
   }
 }
