[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:135:70
 /**
  * Map notification type to ANSI color.
  */
-export function getNotificationColor(type: NotificationType): string {
-  return AnsiColors[type] || AnsiColors.info;
-}
+export function getNotificationColor(type: NotificationType): string {}
 
 /**

[NoCoverage] LogicalOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:136:10
  * Map notification type to ANSI color.
  */
 export function getNotificationColor(type: NotificationType): string {
-  return AnsiColors[type] || AnsiColors.info;
+  return AnsiColors[type] && AnsiColors.info;
 }
 

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:136:10
  * Map notification type to ANSI color.
  */
 export function getNotificationColor(type: NotificationType): string {
-  return AnsiColors[type] || AnsiColors.info;
+  return false;
 }
 

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:153:57
 /**
  * Get ANSI prefix for a foreground color.
  */
-export function fg(color: string, text: string): string {
-  const ansiCode = AnsiColors[color as keyof typeof AnsiColors] || "";
-  if (!ansiCode) return text;
-  return `${ansiCode}${text}${AnsiColors.reset}`;
-}
+export function fg(color: string, text: string): string {}
 
 /**

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:154:20
  * Get ANSI prefix for a foreground color.
  */
 export function fg(color: string, text: string): string {
-  const ansiCode = AnsiColors[color as keyof typeof AnsiColors] || "";
+  const ansiCode = false;
   if (!ansiCode) return text;
   return `${ansiCode}${text}${AnsiColors.reset}`;

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:154:20
  * Get ANSI prefix for a foreground color.
  */
 export function fg(color: string, text: string): string {
-  const ansiCode = AnsiColors[color as keyof typeof AnsiColors] || "";
+  const ansiCode = true;
   if (!ansiCode) return text;
   return `${ansiCode}${text}${AnsiColors.reset}`;

[NoCoverage] BooleanLiteral
extensions/cali-product-workflow/adapters/ui-adapter.ts:155:7
  */
 export function fg(color: string, text: string): string {
   const ansiCode = AnsiColors[color as keyof typeof AnsiColors] || "";
-  if (!ansiCode) return text;
+  if (ansiCode) return text;
   return `${ansiCode}${text}${AnsiColors.reset}`;
 }

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:155:7
  */
 export function fg(color: string, text: string): string {
   const ansiCode = AnsiColors[color as keyof typeof AnsiColors] || "";
-  if (!ansiCode) return text;
+  if (true) return text;
   return `${ansiCode}${text}${AnsiColors.reset}`;
 }

[NoCoverage] BlockStatement
extensions/cali-product-workflow/adapters/ui-adapter.ts:162:66
 /**
  * Truncate text to fit in a width with ellipsis.
  */
-export function truncate(text: string, maxWidth: number): string {
-  if (text.length <= maxWidth) return text;
-  return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
-}
+export function truncate(text: string, maxWidth: number): string {}
 
 // ── Select List Formatter ─────────────────────────────────────────────

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:163:7
  * Truncate text to fit in a width with ellipsis.
  */
 export function truncate(text: string, maxWidth: number): string {
-  if (text.length <= maxWidth) return text;
+  if (true) return text;
   return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
 }

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:163:7
  * Truncate text to fit in a width with ellipsis.
  */
 export function truncate(text: string, maxWidth: number): string {
-  if (text.length <= maxWidth) return text;
+  if (text.length < maxWidth) return text;
   return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
 }

[NoCoverage] ArithmeticOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:164:36
  */
 export function truncate(text: string, maxWidth: number): string {
   if (text.length <= maxWidth) return text;
-  return text.slice(0, Math.max(0, maxWidth - 3)) + "...";
+  return text.slice(0, Math.max(0, maxWidth + 3)) + "...";
 }
 

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:180:7
   const lines: string[] = [];
   
   // Title
-  if (title) {
+  if (true) {
     lines.push(`${AnsiColors.bold}${AnsiColors.cyan}◆ ${title}${AnsiColors.reset}`);
   }

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/ui-adapter.ts:188:36
   options.forEach((opt, i) => {
     const prefix = `${AnsiColors.dim}[${i + 1}]${AnsiColors.reset}`;
     const label = opt.label;
-    const desc = opt.description ? ` ${AnsiColors.dim}- ${opt.description}${AnsiColors.reset}` : "";
+    const desc = opt.description ? `` : "";
     const line = `${prefix} ${label}${desc}`;
     lines.push(truncate(line, maxWidth));

[NoCoverage] StringLiteral
extensions/cali-product-workflow/adapters/ui-adapter.ts:189:18
     const prefix = `${AnsiColors.dim}[${i + 1}]${AnsiColors.reset}`;
     const label = opt.label;
     const desc = opt.description ? ` ${AnsiColors.dim}- ${opt.description}${AnsiColors.reset}` : "";
-    const line = `${prefix} ${label}${desc}`;
+    const line = ``;
     lines.push(truncate(line, maxWidth));
   });

[NoCoverage] ConditionalExpression
extensions/cali-product-workflow/adapters/ui-adapter.ts:205:16
  * Format status line for terminal display.
  */
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
-  const text = info.text || "";
+  const text = false;
   const prefix = info.level === "error" ? AnsiColors.error :
                  info.level === "warning" ? AnsiColors.warning :

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:206:18
  */
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
   const text = info.text || "";
-  const prefix = info.level === "error" ? AnsiColors.error :
+  const prefix = info.level !== "error" ? AnsiColors.error :
                  info.level === "warning" ? AnsiColors.warning :
                  AnsiColors.info;

[NoCoverage] EqualityOperator
extensions/cali-product-workflow/adapters/ui-adapter.ts:207:18
 export function formatStatusLine(info: StatusInfo, maxWidth = 100): string {
   const text = info.text || "";
   const prefix = info.level === "error" ? AnsiColors.error :
-                 info.level === "warning" ? AnsiColors.warning :
+                 info.level !== "warning" ? AnsiColors.warning :
                  AnsiColors.info;
   
